{
  "backend/main.mo": "Main Motoko actor defining all data types (Product, Order, Category, etc.) and stable storage maps for an e-commerce jewellery platform with authorization, blob storage, Stripe, and HTTP outcall mixins.",
  "feature_evidence.json": "Feature evidence report mapping implemented feature IDs (label renames, animations, footer color, layout changes) to their affected frontend files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "Auto-generated JSON summary document describing the purpose and recent changes of each frontend source file across pages, components, and hooks.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property design tokens for light and dark themes including colors, radius, sidebar, and chart variables.",
  "frontend/index.html": "Minimal HTML shell for the Aurelie Fine Jewellery React app, mounting the app at #root and loading the main TSX entry point as an ES module.",
  "frontend/src/App.tsx": "Root React application file that configures TanStack Router with all lazy-loaded routes (including gender-specific home pages and boys/girls category pages), sets up React Query, and handles profile setup modal display after login.",
  "frontend/src/components/admin/BannerManagement.tsx": "An admin component for managing scrolling banner messages, supporting add, update, toggle enabled/disabled, delete, and reorder operations via mutation hooks.",
  "frontend/src/components/admin/BoysHeaderCategoryNavManagement.tsx": "An admin component for managing Boys section category navigation headers, allowing image upload with progress tracking and redirect URL configuration per category slug.",
  "frontend/src/components/admin/CarouselManagement.tsx": "Admin component for managing up to 5 homepage carousel slides, supporting image upload with optimization, URL editing, reordering, and toggling slide visibility.",
  "frontend/src/components/admin/CategoryCarouselManagement.tsx": "Admin component for managing category-specific carousel images (up to 5) and redirect URLs, supporting image upload, reordering, removal, and saving via mutation hooks.",
  "frontend/src/components/admin/CategoryImagesManager.tsx": "Reusable admin component for managing up to 10 category images with support for upload, removal, reordering, and setting a primary thumbnail image.",
  "frontend/src/components/admin/HeaderCategoryNavManagement.tsx": "Admin component for managing header navigation category entries, allowing image upload and redirect URL configuration per product category slug.",
  "frontend/src/components/admin/InquiryManagement.tsx": "Admin component that lists customer inquiries with their status and allows admins to submit text responses to pending inquiries.",
  "frontend/src/components/admin/OrderManagement.tsx": "Admin component that displays all orders with status badges, allows admins to update order statuses via a dropdown, and provides a styled print view for individual orders.",
  "frontend/src/components/admin/ProductFormModal.tsx": "Modal dialog for creating or editing a product, handling fields like name, price, category, gender, and media uploads (images/video) with optimization before submission.",
  "frontend/src/components/admin/ProductManagement.tsx": "Admin panel component that lists all products with thumbnails and prices, and provides buttons to add, edit, or delete products using a form modal and confirmation dialog.",
  "frontend/src/components/admin/SiteContentManagement.tsx": "Admin form component for editing and saving site-wide content such as contact info, social media URLs, and static text pages like privacy policy and terms of service.",
  "frontend/src/components/CategoryCarousel.tsx": "Reusable carousel component that fetches and displays enabled, ordered slides for a given category with auto-rotation, hover pause, navigation arrows, and dot indicators.",
  "frontend/src/components/CategoryImageCarousel.tsx": "A reusable image carousel component for product categories that auto-rotates slides, supports click-through redirects, and shows a skeleton loader while fetching images via category-specific hooks.",
  "frontend/src/components/checkout/CouponControl.tsx": "Checkout component that lets users enter and apply a coupon code with inline validation, displaying a success state with a remove option when a valid coupon is applied.",
  "frontend/src/components/checkout/UpiQrCode.tsx": "Checkout payment component that generates and displays a UPI QR code image via an external API and provides a button to copy the UPI URI to the clipboard.",
  "frontend/src/components/CustomerPageStyleScope.tsx": "A simple wrapper component that adds a `data-customer-page` attribute to scope styles for customer-facing pages.",
  "frontend/src/components/footer/FooterSystem.tsx": "Renders the site footer with logo, contact info, policy links, and social media icons, pulling dynamic content from the `useGetSiteContent` hook.",
  "frontend/src/components/GenderCategoryTabs.tsx": "Renders 'For Him' and 'For Her' navigation tabs that route to `/boys` and `/girls` respectively, hidden on admin routes.",
  "frontend/src/components/HeaderCategoryNav.tsx": "Displays a horizontal scrollable row of product category icons with circular images fetched from the backend, supporting configurable redirect URLs on click.",
  "frontend/src/components/HomeCarousel.tsx": "A full-width home page hero carousel that fetches enabled slides, auto-rotates with directional slide transitions, and supports click-through URL redirects.",
  "frontend/src/components/HomeCategoryCarouselsSection.tsx": "Renders a section on the home page that iterates over all product categories and displays two `CategoryImageCarousel` instances per category.",
  "frontend/src/components/Layout.tsx": "The main application layout providing a sticky header with logo, cart icon with item count, authenticated user dropdown (with admin link), gender tabs, and a footer with marquee banner.",
  "frontend/src/components/MarqueeBanner.tsx": "Displays a continuously scrolling marquee banner with enabled promotional messages fetched from the backend, styled with a gold gradient.",
  "frontend/src/components/OrderDetailModal.tsx": "A modal dialog component that displays full order details including status, items, and pricing, and allows users to cancel an order by selecting a reason from a predefined list.",
  "frontend/src/components/ProductMediaCarousel.tsx": "A carousel component that displays product images and an optional video with navigation arrows and dot indicators, supporting lazy loading for non-adjacent slides.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal form that collects new user profile information (name, email, phone, address) and saves it via the actor, granting admin access if a specific email is used.",
  "frontend/src/components/RouteLoadingFallback.tsx": "A skeleton placeholder component shown while lazy-loaded route components are being fetched, rendering header and card grid skeletons.",
  "frontend/src/components/SplashScreen.tsx": "A full-screen splash screen that displays the Aurelie logo and brand name with a zoom animation, then calls an onComplete callback after 1.5 seconds.",
  "frontend/src/components/StripeSetupModal.tsx": "An empty file with no content or exports.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useAdminUiBodyAttribute.ts": "Sets `data-admin-ui=\"true\"` on `document.body` while the admin route is mounted so Radix portal components inherit admin-scoped styles.",
  "frontend/src/hooks/useBannerQueries.ts": "Provides React Query hooks for fetching all or only enabled banner messages and mutations for adding, updating, and deleting them via the backend actor.",
  "frontend/src/hooks/useCart.ts": "Zustand store with localStorage persistence that manages cart items, including add, remove, update quantity, clear, and total price/count helpers.",
  "frontend/src/hooks/useCategoryCarouselQueries.ts": "React Query hooks for reading and updating per-category carousel images and redirect URLs via the backend actor.",
  "frontend/src/hooks/useCategoryHeaderNav.ts": "React Query hooks for fetching all or a single category header and a mutation for setting a category header via the backend actor.",
  "frontend/src/hooks/useFooterVariant.ts": "Simple hook that always returns the `'split'` footer variant with no state management.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` and `useInternetIdentity` hook that manage ICP AuthClient lifecycle, login/logout, and identity state.",
  "frontend/src/hooks/useQueries.ts": "Central collection of React Query hooks covering user profiles, admin checks, categories, homepage carousel slides, products, orders, and site content via the backend actor.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind CSS, defines OKLCH-based CSS custom properties for light/dark themes, Aurelie brand colors, and custom utility classes/animations for luxury UI elements.",
  "frontend/src/main.tsx": "React app entry point that mounts the app with QueryClientProvider for data fetching and InternetIdentityProvider for authentication.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Admin page for viewing and managing all orders with filtering by date range or month/year, order status updates, and detailed order inspection.",
  "frontend/src/pages/admin/CategoryEditPage.tsx": "Admin page for editing an existing category, allowing updates to name, description, display order, and images with admin-only access control.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page that checks caller admin status and renders tabbed management sections for products, orders, inquiries, site content, carousels, banners, and category navigation.",
  "frontend/src/pages/BoysHomePage.tsx": "Boys/men's category home page that displays animated category circles fetched from category headers, navigating to sub-category routes or redirect URLs on click.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page that displays cart items with quantity controls and removal, shows a total price, and requires authentication to view.",
  "frontend/src/pages/categories/AnkletsPage.tsx": "Category page for Anklets, rendering the shared CategoryPageTemplate with the 'anklets' slug and relevant description.",
  "frontend/src/pages/categories/boys/BoysBraceletPage.tsx": "Category page for Boys Bracelet, rendering CategoryPageTemplate with the 'boys-bracelet' slug and a 'boys' gender filter.",
  "frontend/src/pages/categories/boys/BoysChainsPage.tsx": "Category page for Boys Chains, rendering CategoryPageTemplate with the 'boys-chains' slug and a 'boys' gender filter.",
  "frontend/src/pages/categories/boys/BoysLabDiamondsPage.tsx": "Category page for Boys Lab Diamonds, rendering CategoryPageTemplate with the 'boys-lab-diamonds' slug and a 'boys' gender filter.",
  "frontend/src/pages/categories/boys/BoysRingsPage.tsx": "Category page for Boys Rings, rendering CategoryPageTemplate with the 'boys-rings' slug and a 'boys' gender filter.",
  "frontend/src/pages/categories/BridalJewelleryPage.tsx": "Category page for Bridal Jewellery, rendering the shared CategoryPageTemplate with the 'bridal-jewellery' slug.",
  "frontend/src/pages/categories/CategoryNotFoundPage.tsx": "Empty placeholder file for a category-not-found page with no implemented content.",
  "frontend/src/pages/categories/CategoryPageTemplate.tsx": "Reusable template component that displays a category header and product grid, supporting optional gender filtering, add-to-cart, and buy-now actions.",
  "frontend/src/pages/categories/EarringsPage.tsx": "Category page for Earrings, rendering the shared CategoryPageTemplate with the 'earrings' slug.",
  "frontend/src/pages/categories/LabGrownDiamondsJewelleryPage.tsx": "Category page for Lab Grown Diamonds Jewellery, rendering the shared CategoryPageTemplate with the 'lab-diamonds-jewellery' slug.",
  "frontend/src/pages/categories/NecklacePage.tsx": "Category page for Necklaces, rendering the shared CategoryPageTemplate with the 'necklace' slug.",
  "frontend/src/pages/categories/RingsPage.tsx": "Category page for Rings, rendering the shared CategoryPageTemplate with the 'rings' slug.",
  "frontend/src/pages/CheckoutPage.tsx": "Two-step checkout page (address then payment) that pre-fills user profile data, supports coupon codes, computes discounted totals, and generates UPI payment URIs for order creation.",
  "frontend/src/pages/ContactPage.tsx": "A contact form page that allows authenticated users to submit customer inquiries (name, email, message) to the backend, showing a login prompt if unauthenticated.",
  "frontend/src/pages/CustomerDashboardPage.tsx": "A customer dashboard page displaying order history and inquiries in tabs, with order status icons, INR formatting, and a clickable order detail modal.",
  "frontend/src/pages/GirlsHomePage.tsx": "A landing page for the women's jewellery section showing animated category circles fetched from backend headers, with a hero banner and category navigation bar.",
  "frontend/src/pages/HomePage.tsx": "The main homepage rendering a hero carousel, category carousels section, and a product grid with add-to-cart and buy-now actions.",
  "frontend/src/pages/OrdersPage.tsx": "A page listing the authenticated customer's orders with status badges, formatted dates and prices, and a modal for order details.",
  "frontend/src/pages/PaymentFailurePage.tsx": "A simple payment failure screen with an error icon and buttons to return to the cart or navigate back to the homepage.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Displays a payment success confirmation page with order details and next steps, providing navigation buttons to the dashboard or home page.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Fetches and displays the site's privacy policy content from the backend, showing a loading spinner while data is being retrieved.",
  "frontend/src/pages/ProductCategoryPage.tsx": "Displays a filtered grid of products for a given category slug, with add-to-cart and buy-now actions requiring authentication.",
  "frontend/src/pages/ProductDetailPage.tsx": "Shows detailed information for a single product including a media carousel, price, stock status, and quantity-based add-to-cart/buy-now controls.",
  "frontend/src/pages/ProfileDetailsPage.tsx": "Allows authenticated users to view and edit their personal profile information (name, email, phone, address, DOB) with save validation.",
  "frontend/src/pages/ShippingPolicyPage.tsx": "Fetches and displays the site's shipping policy content from the backend, showing a loading spinner while data is being retrieved.",
  "frontend/src/pages/TermsConditionsPage.tsx": "Fetches and displays the site's terms and conditions content from the backend, showing a loading spinner while data is being retrieved.",
  "frontend/src/utils/device.ts": "Utility that detects whether the user is on a mobile device using the modern navigator.userAgentData API with a user-agent string fallback.",
  "frontend/src/utils/mediaOptimization.ts": "Client-side utilities to resize and compress images via canvas before upload, and a passthrough helper for video files.",
  "frontend/src/utils/pricing.ts": "Centralized pricing utilities for computing cart subtotals, validating the 'AFJ10' coupon for a 10% discount, and formatting amounts in INR.",
  "frontend/src/utils/productCategories.ts": "Defines and exports all product category metadata (slugs, titles, descriptions, gender) for both girls and boys, with lookup and options helper functions.",
  "frontend/src/utils/upi.ts": "Utilities for generating UPI deep-link URIs for payment, including generic UPI, Google Pay, and PhonePe links pre-configured for Aurelie Fine Jewellery.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom color palette (navy, gold, beige, silver, etc. using OKLCH), extended border radius, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata for 'Aurelie Fine Jewellery' e-commerce app, tracking existing features (label renames, animations, footer color, category section relocation) and pending feature requests."
}