{
  "backend/main.mo": "Main Motoko actor defining all backend types (Product, Order, Category, etc.) and stable storage maps for an e-commerce jewellery platform, with constants for cancellation windows and media limits.",
  "feature_evidence.json": "Feature evidence report mapping three feature IDs (remove OurStoryStrip, add ProductFilterBar/HeaderCategoryNav to category pages, add horizontally scrollable product card rows on homepage) to their affected files and test IDs.",
  "frontend-file-summaries.txt": "Auto-generated JSON summary document describing the purpose and recent changes of each frontend source file across pages, components, and hooks.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for light and dark theme color tokens (background, foreground, primary, chart colors, sidebar, etc.).",
  "frontend/index.html": "Minimal HTML shell for the Aurelie Fine Jewellery React app, mounting the app into a root div and loading the main TSX entry point as an ES module.",
  "frontend/src/App.tsx": "Root React application component that sets up TanStack Router with all lazy-loaded page routes (including boys/girls gender and category pages), QueryClient, ThemeProvider, and a ProfileSetupWrapper that shows a profile modal for new authenticated users.",
  "frontend/src/components/admin/BannerManagement.tsx": "An admin UI for managing scrolling banner messages, supporting add, update, toggle enabled/disabled, delete, and reorder operations via mutation hooks.",
  "frontend/src/components/admin/BoysHeaderCategoryNavManagement.tsx": "An admin panel for uploading and saving header images with redirect URLs for Boys section sub-categories, using image optimization before storage.",
  "frontend/src/components/admin/CarouselManagement.tsx": "An admin component for managing up to 5 homepage carousel slides, supporting image upload with optimization, URL editing, enable/disable toggling, and reordering.",
  "frontend/src/components/admin/CategoryCarouselManagement.tsx": "Admin component for managing category carousel images (up to 5) and redirect URLs, supporting upload, reorder, and delete operations with progress tracking.",
  "frontend/src/components/admin/CategoryImagesManager.tsx": "Admin component for managing up to 10 category images with support for upload, reorder, remove, and setting a primary thumbnail image.",
  "frontend/src/components/admin/HeaderCategoryNavManagement.tsx": "Admin component for managing header navigation category images and redirect URLs, allowing per-category image upload and save for all product categories.",
  "frontend/src/components/admin/InquiryManagement.tsx": "Admin component that lists customer inquiries and allows admins to send text responses to pending inquiries.",
  "frontend/src/components/admin/OrderManagement.tsx": "Admin component for viewing and managing orders, including status updates (pending/confirmed/shipped/delivered) and a print order feature with styled HTML output.",
  "frontend/src/components/admin/ProductFormModal.tsx": "A modal dialog form for creating and editing products, handling fields like name, price, category, gender, and media (images/video) with optimization support.",
  "frontend/src/components/admin/ProductManagement.tsx": "Admin panel component that lists all products with edit/delete actions and opens ProductFormModal for adding or updating products.",
  "frontend/src/components/admin/SiteContentManagement.tsx": "Admin form component for editing site-wide content such as contact info, social media URLs, and policy text fields, persisted via an update mutation.",
  "frontend/src/components/CategoryCarousel.tsx": "Reusable image carousel component that fetches enabled, ordered slides for a given category and auto-rotates every 3 seconds with pause-on-hover, navigation arrows, and dot indicators.",
  "frontend/src/components/CategoryImageCarousel.tsx": "A reusable image carousel component for product categories that auto-rotates slides, supports manual navigation, and optionally redirects on click. Fetches images and redirect URL via category-specific hooks.",
  "frontend/src/components/CategoryProductRow.tsx": "Renders a horizontally scrollable row of product cards filtered by category slug and optional gender, displaying product image and INR-formatted price.",
  "frontend/src/components/checkout/CouponControl.tsx": "Checkout component that lets users enter, validate, apply, and remove coupon codes, displaying a success state and discount message when a valid code is applied.",
  "frontend/src/components/checkout/UpiQrCode.tsx": "Renders a UPI payment QR code image fetched from an external API and provides a button to copy the UPI URI to the clipboard.",
  "frontend/src/components/CustomerPageStyleScope.tsx": "A simple wrapper component that adds a `data-customer-page` attribute to scope styles for customer-facing pages.",
  "frontend/src/components/footer/FooterSystem.tsx": "Site footer component that displays the logo, contact information, policy links, and social media icons sourced from site content data.",
  "frontend/src/components/GenderCategoryTabs.tsx": "Renders 'For Him' and 'For Her' navigation tabs that route to `/boys` and `/girls` respectively, hidden on admin routes.",
  "frontend/src/components/HeaderCategoryNav.tsx": "Displays a horizontal scrollable row of category icons with titles fetched from the backend, supporting configurable redirect URLs per category.",
  "frontend/src/components/HomeCarousel.tsx": "A full-width home page hero carousel with directional slide transitions, auto-rotation, hover pause, and click-through redirect support.",
  "frontend/src/components/HomeCategoryCarouselsSection.tsx": "Renders a full-page section listing all product categories, each with two image carousels and a horizontally scrollable product row filtered to girls.",
  "frontend/src/components/Layout.tsx": "Main application layout providing a sticky header with logo, search bar, cart icon, user auth dropdown, gender tabs, and a footer, wrapping page content via `<Outlet>`.",
  "frontend/src/components/MarqueeBanner.tsx": "Renders a horizontally scrolling marquee banner that fetches and displays enabled banner messages joined with decorative separators, pausing on hover.",
  "frontend/src/components/MasonryProductGrid.tsx": "Displays products in a CSS masonry grid with staggered entrance animations via IntersectionObserver, and provides add-to-cart, buy-now, and product detail navigation actions.",
  "frontend/src/components/NewArrivalsSection.tsx": "Renders a horizontally scrollable row of new-arrival product cards with images, names, and prices, showing skeletons while loading and hiding the section if no products exist.",
  "frontend/src/components/OrderDetailModal.tsx": "A dialog modal that shows full order details including status, items, and pricing, and allows users to cancel an eligible order by selecting a reason.",
  "frontend/src/components/OurStoryStrip.tsx": "A full-width decorative brand story section with a background image, gold accents, and scroll-triggered fade/slide-in animations linking to the contact page.",
  "frontend/src/components/ProductFilterBar.tsx": "A filter toolbar that provides dropdowns for metal type, price range, occasion, and sort order, along with active filter count and a clear-all button.",
  "frontend/src/components/ProductMediaCarousel.tsx": "A React carousel component that displays product media (video first, then images) with navigation arrows and dot indicators, supporting lazy loading and smooth opacity transitions.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that collects new user profile information (name, email, phone, address) and saves it via the actor, granting admin access if a specific email is used.",
  "frontend/src/components/RouteLoadingFallback.tsx": "A skeleton placeholder component shown while lazy-loaded route components are being fetched, displaying header and grid card skeletons.",
  "frontend/src/components/SplashScreen.tsx": "A full-screen splash screen that displays the Aurelie logo and brand name for 1.5 seconds before calling an onComplete callback.",
  "frontend/src/components/StripeSetupModal.tsx": "An empty file with no content.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor using React Query, returning either an authenticated or anonymous actor based on the current Internet Identity, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminUiBodyAttribute.ts": "Sets a `data-admin-ui=\"true\"` attribute on `document.body` while the admin route is mounted, ensuring Radix UI portals inherit admin-scoped styles.",
  "frontend/src/hooks/useBannerQueries.ts": "Provides React Query hooks for fetching, adding, updating, and deleting banner messages via the backend actor.",
  "frontend/src/hooks/useCart.ts": "Zustand store with persistence for managing a shopping cart, supporting add, remove, update quantity, clear, and total calculations.",
  "frontend/src/hooks/useCategoryCarouselQueries.ts": "Provides React Query hooks for fetching and updating category carousel images and redirect URLs via the backend actor.",
  "frontend/src/hooks/useCategoryHeaderNav.ts": "Provides React Query hooks for fetching all category headers, fetching a single category header by slug, and setting a category header via the backend actor.",
  "frontend/src/hooks/useFooterVariant.ts": "Simple hook that always returns the `'split'` footer variant with no state management.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication via `AuthClient`, exposing login/logout functions, identity state, and login status through a React context provider and hook.",
  "frontend/src/hooks/useProductFilters.ts": "Manages product filter state (metal type, price range, occasion, sort order) and returns memoized filtered/sorted product lists along with an active filter count.",
  "frontend/src/hooks/useQueries.ts": "Central collection of React Query hooks for all major backend operations including user profiles, admin checks, categories, carousel slides, products, orders, and site content.",
  "frontend/src/index.css": "Global stylesheet that imports Tailwind directives and defines OKLCH-based CSS custom properties for light/dark themes, Aurelie brand colors, and utility classes for luxury UI elements and animations.",
  "frontend/src/main.tsx": "React app entry point that mounts the app with QueryClientProvider for data fetching and InternetIdentityProvider for authentication.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Admin page for viewing and managing all orders with filtering by date range or month/year, order status updates, and detailed order inspection.",
  "frontend/src/pages/admin/CategoryEditPage.tsx": "Admin page for editing an existing category, allowing updates to name, description, display order, and images, with admin access guard and loading skeletons.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page that checks caller admin status and renders tabbed management sections for products, orders, inquiries, site content, carousels, banners, and categories with summary stat cards.",
  "frontend/src/pages/BoysHomePage.tsx": "Boys/men's jewellery home page that displays a hero header and animated category circles fetched from category headers, navigating to subcategory pages or redirect URLs on click.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page that lists cart items with quantity controls and removal, shows a total price, and requires authentication; redirects unauthenticated users with a login prompt.",
  "frontend/src/pages/categories/AnkletsPage.tsx": "Category page for Anklets, rendering the shared CategoryPageTemplate with the 'anklets' slug and description.",
  "frontend/src/pages/categories/boys/BoysBraceletPage.tsx": "Category page for Boys Bracelet, rendering CategoryPageTemplate with the 'boys-bracelet' slug and a boys gender filter.",
  "frontend/src/pages/categories/boys/BoysChainsPage.tsx": "Category page for Boys Chains, rendering CategoryPageTemplate with the 'boys-chains' slug and a boys gender filter.",
  "frontend/src/pages/categories/boys/BoysLabDiamondsPage.tsx": "Category page for Boys Lab Diamonds, rendering CategoryPageTemplate with the 'boys-lab-diamonds' slug and a boys gender filter.",
  "frontend/src/pages/categories/boys/BoysRingsPage.tsx": "Category page for Boys Rings, rendering CategoryPageTemplate with the 'boys-rings' slug and a boys gender filter.",
  "frontend/src/pages/categories/BridalJewelleryPage.tsx": "Category page for Bridal Jewellery, rendering the shared CategoryPageTemplate with the 'bridal-jewellery' slug and description.",
  "frontend/src/pages/categories/CategoryNotFoundPage.tsx": "Empty placeholder file for a category-not-found page with no implementation.",
  "frontend/src/pages/categories/CategoryPageTemplate.tsx": "Reusable template for category product listing pages, supporting filtering, sorting, add-to-cart, and buy-now actions with a masonry grid layout.",
  "frontend/src/pages/categories/EarringsPage.tsx": "Category page for Earrings, rendering the shared CategoryPageTemplate with the 'earrings' slug and description.",
  "frontend/src/pages/categories/LabGrownDiamondsJewelleryPage.tsx": "Category page for Lab Grown Diamonds Jewellery, rendering the shared CategoryPageTemplate with the 'lab-diamonds-jewellery' slug and description.",
  "frontend/src/pages/categories/NecklacePage.tsx": "Category page for Necklaces, rendering the shared CategoryPageTemplate with the 'necklace' slug and description.",
  "frontend/src/pages/categories/RingsPage.tsx": "Category page for Rings, rendering the shared CategoryPageTemplate with the 'rings' slug and description.",
  "frontend/src/pages/CheckoutPage.tsx": "Two-step checkout page (address then payment) that pre-fills user profile data, supports coupon codes for discounts, generates UPI payment URIs, and submits orders via the createOrder mutation.",
  "frontend/src/pages/ContactPage.tsx": "A contact form page that allows authenticated users to submit customer inquiries (name, email, message) to the backend, showing a login prompt if unauthenticated.",
  "frontend/src/pages/CustomerDashboardPage.tsx": "Customer dashboard page displaying a tabbed overview of the user's orders and inquiries with status badges, order detail modal, and INR price formatting.",
  "frontend/src/pages/GirlsHomePage.tsx": "A landing page for the women's jewellery section that renders animated category circles fetched from backend headers, with a hero header and category navigation bar.",
  "frontend/src/pages/HomePage.tsx": "Main storefront homepage composing a hero carousel, new arrivals section, category carousels, and a full product grid with add-to-cart and buy-now actions.",
  "frontend/src/pages/OrdersPage.tsx": "Order history page for authenticated customers that lists all their orders with status icons, formatted dates and prices, and opens an order detail modal on click.",
  "frontend/src/pages/PaymentFailurePage.tsx": "A simple payment failure screen shown after an unsuccessful checkout, offering buttons to return to the cart or navigate back to the homepage.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Displays a payment success confirmation page with order details and next steps, providing navigation buttons to the dashboard or home page.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Fetches and displays the site's privacy policy content from the backend, showing a loading spinner while data is being retrieved.",
  "frontend/src/pages/ProductCategoryPage.tsx": "Displays a filtered grid of products for a given category slug, with add-to-cart and buy-now actions requiring authentication.",
  "frontend/src/pages/ProductDetailPage.tsx": "Shows detailed information for a single product including a media carousel, price, stock status, and quantity-based add-to-cart/buy-now controls.",
  "frontend/src/pages/ProfileDetailsPage.tsx": "Allows authenticated users to view and edit their profile information (name, email, phone, address, DOB) with form validation and save functionality.",
  "frontend/src/pages/ShippingPolicyPage.tsx": "Fetches and displays the site's shipping policy content from the backend, showing a loading spinner while data is being retrieved.",
  "frontend/src/pages/TermsConditionsPage.tsx": "Fetches and displays the site's terms and conditions content from the backend, showing a loading spinner while data is being retrieved.",
  "frontend/src/utils/device.ts": "Utility for detecting mobile devices using the modern navigator.userAgentData API with a user-agent string fallback.",
  "frontend/src/utils/mediaOptimization.ts": "Client-side utilities to resize and compress images via canvas before upload, and a passthrough stub for video optimization.",
  "frontend/src/utils/pricing.ts": "Centralized pricing utilities for computing cart subtotals, validating the 'AFJ10' coupon, calculating discounts, and formatting INR amounts.",
  "frontend/src/utils/productCategories.ts": "Defines and exports all product category metadata (slugs, titles, descriptions, gender) for both girls and boys, with lookup and options helper functions.",
  "frontend/src/utils/upi.ts": "Utilities for generating UPI deep-link URIs for payments, including app-specific links for Google Pay and PhonePe targeting Aurelie Fine Jewellery's VPA.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the theme with custom OKLCH-based color palettes (navy, gold, beige, silver, etc.), border radii, and plugins including typography, container queries, and animations.",
  "project_state.json": "Project state metadata for 'Aurelie Fine Jewellery' e-commerce site, tracking existing features (homepage carousels, product filters, category nav) and pending feature requests (remove Our Story strip, verify filters, add scrollable product card rows)."
}