{
  "backend/main.mo": "Main Motoko actor defining all backend types (Product, Order, Category, etc.) and business logic for an e-commerce jewellery app, including constants for cancellation windows and media limits, and imports for storage, Stripe, authorization, and HTTP outcalls.",
  "feature_evidence.json": "Feature evidence report listing implemented features with associated file paths, component dependencies, test IDs, and confidence levels, covering cart button label removal, filter panel redesign, and recently viewed section.",
  "frontend-file-summaries.txt": "JSON document summarizing each frontend source file's purpose and recent changes, serving as a human-readable changelog/index for the frontend codebase.",
  "frontend/index.css": "Global CSS entry point that imports Tailwind directives and defines CSS custom properties for the design system's color tokens in both light and dark modes.",
  "frontend/index.html": "Minimal HTML shell for the React SPA titled 'Aurelie Fine Jewellery Mobile App' that mounts the app into a root div and loads the main TypeScript entry point.",
  "frontend/src/App.tsx": "Root application component that sets up TanStack Router with all lazy-loaded page routes (including boys/girls category pages), wraps the app in QueryClient and ThemeProvider, and handles profile setup modal display after authentication.",
  "frontend/src/components/admin/BannerManagement.tsx": "An admin panel component for managing scrolling banner messages, supporting add, edit, toggle enabled/disabled, delete, and reorder operations via mutation hooks.",
  "frontend/src/components/admin/BoysHeaderCategoryNavManagement.tsx": "Admin component for managing circular category images and redirect URLs for the Boys section sub-categories in the header navigation. Supports image upload with optimization and progress tracking, and saves headers per category slug.",
  "frontend/src/components/admin/CarouselManagement.tsx": "Admin component for managing up to 5 homepage carousel slides, supporting image upload/optimization, URL editing, enable/disable toggling, and slide reordering.",
  "frontend/src/components/admin/CategoryCarouselManagement.tsx": "Admin component for managing images and redirect URLs for a specific category carousel (index 1 or 2), supporting adding, removing, reordering, and saving up to 5 images.",
  "frontend/src/components/admin/CategoryImagesManager.tsx": "Admin component for managing up to 10 category images with support for uploading, removing, reordering, and setting a primary thumbnail image.",
  "frontend/src/components/admin/HeaderCategoryNavManagement.tsx": "Admin component for managing circular category images and redirect URLs for the main header navigation row, mirroring the Boys variant but using PRODUCT_CATEGORIES.",
  "frontend/src/components/admin/InquiryManagement.tsx": "Admin component that lists customer inquiries fetched via React Query and allows admins to submit text responses to pending inquiries with toast feedback.",
  "frontend/src/components/admin/OrderManagement.tsx": "Admin component that displays all orders with status badges, allows status updates via a dropdown, and supports printing individual order details in a styled pop-up window.",
  "frontend/src/components/admin/ProductFormModal.tsx": "Modal dialog for creating or editing a product, handling name, description, price, category, gender, and media (image/video) uploads with optimization before submission.",
  "frontend/src/components/admin/ProductManagement.tsx": "Admin panel component that lists all products with edit and delete actions, using a confirmation dialog for deletion and delegating create/edit to ProductFormModal.",
  "frontend/src/components/admin/SiteContentManagement.tsx": "Admin form component for viewing and updating site-wide content fields such as contact info, social media URLs, and static text pages like terms and privacy policy.",
  "frontend/src/components/CategoryCarousel.tsx": "Auto-rotating image carousel component for a product category that fetches enabled slides, supports manual navigation arrows and dot indicators, pauses on hover, and links each slide to a redirect URL.",
  "frontend/src/components/CategoryImageCarousel.tsx": "A reusable image carousel component for a product category that auto-rotates slides, supports manual navigation, pauses on hover, and optionally redirects on click.",
  "frontend/src/components/CategoryProductRow.tsx": "Renders a horizontally scrollable row of product cards filtered by category slug and optional gender, displaying image, name, and price.",
  "frontend/src/components/checkout/CouponControl.tsx": "Checkout component that lets users enter, validate, and apply or remove a coupon code, displaying a success state with discount info when a valid code is applied.",
  "frontend/src/components/checkout/UpiQrCode.tsx": "Renders a UPI payment QR code image fetched from qrserver.com API and provides a button to copy the UPI URI to the clipboard.",
  "frontend/src/components/CustomerPageStyleScope.tsx": "A simple wrapper component that adds a `data-customer-page` attribute to scope customer-facing styles.",
  "frontend/src/components/FilterIconButton.tsx": "An icon button that opens a filter panel, displaying a badge with the count of active filters.",
  "frontend/src/components/FilterPanel.tsx": "A slide-in sheet panel with draft-state filter controls (metal type, price range, occasion, sort order) that applies changes only on explicit confirmation.",
  "frontend/src/components/footer/FooterSystem.tsx": "Site footer component that displays the logo, contact info, policy links, and social media icons using data from the site content query.",
  "frontend/src/components/GenderCategoryTabs.tsx": "Renders 'For Him' and 'For Her' navigation tabs that route to `/boys` and `/girls`, hidden on admin routes.",
  "frontend/src/components/HeaderCategoryNav.tsx": "A horizontal scrollable category navigation bar showing circular category images fetched from the backend, with optional redirect URL support per category.",
  "frontend/src/components/HomeCarousel.tsx": "A full-width home page hero carousel that auto-rotates enabled slides with directional slide transitions, manual navigation, and click-through redirect support.",
  "frontend/src/components/HomeCategoryCarouselsSection.tsx": "Renders a full-page section listing all product categories, each with two image carousels and a horizontally scrollable product row filtered to girls.",
  "frontend/src/components/Layout.tsx": "Main application layout component that renders the sticky header with navigation, search bar, auth controls, cart icon, and wraps page content with a footer and marquee banner. Handles login/logout via Internet Identity and admin route detection.",
  "frontend/src/components/MarqueeBanner.tsx": "Displays a horizontally scrolling marquee banner with enabled promotional messages fetched from the backend, styled with a gold gradient background.",
  "frontend/src/components/MasonryProductGrid.tsx": "Renders a masonry-style product grid with staggered entrance animations using IntersectionObserver, showing product cards with add-to-cart and buy-now actions.",
  "frontend/src/components/NewArrivalsSection.tsx": "Displays a horizontally scrollable row of new arrival products with loading skeletons, fetched via a custom query hook, each linking to its product detail page.",
  "frontend/src/components/OrderDetailModal.tsx": "Modal dialog showing full order details including status, items, and pricing, with an optional cancellation form that lets users select a reason and submit a cancellation request.",
  "frontend/src/components/OurStoryStrip.tsx": "A full-width decorative brand story section with a background image, animated text reveal on scroll via IntersectionObserver, and a call-to-action button linking to the contact page.",
  "frontend/src/components/ProductFilterBar.tsx": "A filter bar component for products that provides dropdowns for metal type, price range, occasion, and sort order, along with active filter count badge and a clear-all button.",
  "frontend/src/components/ProductMediaCarousel.tsx": "A carousel component for product media that displays video (first) and images in a square aspect ratio with navigation arrows and dot indicators.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that collects new user profile information (name, email, phone, address) and saves it via the actor, granting admin access if a specific email is used.",
  "frontend/src/components/RecentlyViewedSection.tsx": "A horizontally scrollable section that displays recently viewed products fetched from local state and the product list, with skeleton loading states.",
  "frontend/src/components/RouteLoadingFallback.tsx": "A skeleton placeholder layout shown while lazy-loaded route components are being fetched, displaying header and grid card skeletons.",
  "frontend/src/components/SplashScreen.tsx": "A full-screen splash screen that shows the Aurelie logo and brand name with a zoom animation, then calls onComplete after 1.5 seconds.",
  "frontend/src/components/StripeSetupModal.tsx": "An empty file with no content or exports.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminUiBodyAttribute.ts": "Hook that sets a `data-admin-ui` attribute on `document.body` while an admin route is mounted, enabling scoped CSS for Radix UI portals.",
  "frontend/src/hooks/useBannerQueries.ts": "Provides React Query hooks for fetching, adding, updating, and deleting banner messages via the backend actor.",
  "frontend/src/hooks/useCart.ts": "Zustand store with persistence for managing a shopping cart, including add, remove, update quantity, clear, and total calculation operations.",
  "frontend/src/hooks/useCategoryCarouselQueries.ts": "React Query hooks for fetching and updating category carousel images and redirect URLs via the backend actor.",
  "frontend/src/hooks/useCategoryHeaderNav.ts": "React Query hooks for fetching all category headers or a single category header, and a mutation hook for setting a category header via the backend actor.",
  "frontend/src/hooks/useFooterVariant.ts": "Simple hook that always returns the `'split'` footer variant with no state management.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login, logout, and identity persistence across page reloads.",
  "frontend/src/hooks/useProductFilters.ts": "Custom React hook that filters and sorts a list of products by metal type, price range, and occasion, and tracks the count of active filters.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for fetching and mutating backend data including products, orders, inquiries, categories, carousel slides, user profiles, and admin checks.",
  "frontend/src/hooks/useRecentlyViewed.ts": "Custom hook that persists and manages a list of recently viewed product IDs (up to 10) in localStorage.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind directives, defines OKLCH-based CSS custom properties for the Aurelie brand color system, and adds utility classes and keyframe animations.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with React Query and Internet Identity providers wrapping the root App component.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Admin page for viewing and managing orders with filtering by date range and month/year, order status updates, and detailed order display including product names and cancellation reasons.",
  "frontend/src/pages/admin/CategoryEditPage.tsx": "Admin page for editing an existing category's name, description, display order, and images, with access control and navigation back to the admin dashboard on save.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page that displays stats (products, orders, inquiries) and provides tabbed management interfaces for products, orders, inquiries, site content, carousels, and categories, gated behind an admin check.",
  "frontend/src/pages/BoysHomePage.tsx": "Homepage for the men's jewellery section that displays animated category circles fetched from category headers, navigating to subcategory pages or custom redirect URLs on click.",
  "frontend/src/pages/CartPage.tsx": "Displays the shopping cart with item list, quantity controls, and remove buttons, requiring authentication. Shows empty/login states and formats prices in INR.",
  "frontend/src/pages/categories/AnkletsPage.tsx": "Category page for Anklets, rendering the shared CategoryPageTemplate with the 'anklets' slug and relevant title/description.",
  "frontend/src/pages/categories/boys/BoysBraceletPage.tsx": "Category page for Boys Bracelets, rendering CategoryPageTemplate with the 'boys-bracelet' slug and a 'boys' gender filter.",
  "frontend/src/pages/categories/boys/BoysChainsPage.tsx": "Category page for Boys Chains, rendering CategoryPageTemplate with the 'boys-chains' slug and a 'boys' gender filter.",
  "frontend/src/pages/categories/boys/BoysLabDiamondsPage.tsx": "Category page for Boys Lab Diamonds, rendering CategoryPageTemplate with the 'boys-lab-diamonds' slug and a 'boys' gender filter.",
  "frontend/src/pages/categories/boys/BoysRingsPage.tsx": "Category page for Boys Rings, rendering CategoryPageTemplate with the 'boys-rings' slug and a 'boys' gender filter.",
  "frontend/src/pages/categories/BridalJewelleryPage.tsx": "Category page for Bridal Jewellery, rendering the shared CategoryPageTemplate with the 'bridal-jewellery' slug and relevant title/description.",
  "frontend/src/pages/categories/CategoryNotFoundPage.tsx": "Empty file with no content, likely a placeholder for a category-not-found page.",
  "frontend/src/pages/categories/CategoryPageTemplate.tsx": "Reusable template for category product listing pages that filters products by category slug and optional gender, applies live filters/sorting, and supports add-to-cart and buy-now actions.",
  "frontend/src/pages/categories/EarringsPage.tsx": "Category page for Earrings, rendering the shared CategoryPageTemplate with the 'earrings' slug and relevant title/description.",
  "frontend/src/pages/categories/LabGrownDiamondsJewelleryPage.tsx": "Category page for Lab Grown Diamonds Jewellery, rendering the shared CategoryPageTemplate with the 'lab-diamonds-jewellery' slug and relevant title/description.",
  "frontend/src/pages/categories/NecklacePage.tsx": "Category page for Necklaces, rendering the shared CategoryPageTemplate with the 'necklace' slug and relevant title/description.",
  "frontend/src/pages/categories/RingsPage.tsx": "Category page for Rings, rendering the shared CategoryPageTemplate with the 'rings' slug and relevant title/description.",
  "frontend/src/pages/CheckoutPage.tsx": "Multi-step checkout page handling shipping address entry, coupon application, and UPI payment submission to create an order. Computes discounted totals and generates UPI URIs for payment.",
  "frontend/src/pages/ContactPage.tsx": "Contact form page that allows authenticated users to submit customer inquiries with name, email, and message fields via the submitInquiry mutation.",
  "frontend/src/pages/CustomerDashboardPage.tsx": "Customer dashboard showing tabbed views of the user's orders and inquiries with status badges, loading skeletons, and an order detail modal.",
  "frontend/src/pages/GirlsHomePage.tsx": "Landing page for the women's jewellery section featuring animated category circles fetched from category headers and a hero banner with navigation.",
  "frontend/src/pages/HomePage.tsx": "Main homepage composing the hero carousel, new arrivals, category carousels, and recently viewed sections into a single layout.",
  "frontend/src/pages/OrdersPage.tsx": "Displays a customer's order history with status badges, order details, and product names, supporting click-through to an OrderDetailModal for full order information.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows a payment failure message with buttons to return to the cart or navigate back to the home page.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Displays a payment success confirmation with next-steps information and navigation buttons to view orders or return home.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Fetches and renders the site's privacy policy text from backend content, showing a loading spinner while data is retrieved.",
  "frontend/src/pages/ProductCategoryPage.tsx": "Renders a filtered product grid for a given category slug, with add-to-cart, buy-now, and view-details actions, validating the slug against known categories.",
  "frontend/src/pages/ProductDetailPage.tsx": "Shows full details for a single product including a media carousel, price, quantity selector, and add-to-cart/buy-now buttons, while tracking the product as recently viewed.",
  "frontend/src/pages/ProfileDetailsPage.tsx": "Provides a form for authenticated users to view and edit their profile information (name, email, phone, address, DOB), with validation and save functionality.",
  "frontend/src/pages/ShippingPolicyPage.tsx": "Fetches and renders the site's shipping policy text from backend content, showing a loading spinner while data is retrieved.",
  "frontend/src/pages/TermsConditionsPage.tsx": "Displays the Terms & Conditions page by fetching site content via a query hook and rendering the termsOfService field, with a loading spinner while data is fetched.",
  "frontend/src/utils/device.ts": "Utility function to detect if the user is on a mobile device using the modern navigator.userAgentData API with a user-agent string fallback.",
  "frontend/src/utils/mediaOptimization.ts": "Client-side utilities to resize and compress images using a canvas before upload, with parallel multi-image support and a passthrough stub for video optimization.",
  "frontend/src/utils/pricing.ts": "Centralized pricing utilities for cart checkout, including subtotal calculation, coupon validation (AFJ10 for 10% off), discount computation, and INR formatting.",
  "frontend/src/utils/productCategories.ts": "Defines product category data and utility functions for both girls and boys jewellery categories, including slug-based lookup, validation, and option-list generators.",
  "frontend/src/utils/upi.ts": "Provides utility functions for generating UPI payment deep links (standard UPI, Google Pay, PhonePe) for Aurelie Fine Jewellery with a fixed payee VPA.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both query strings and hash-based routing, with sessionStorage persistence helpers for sensitive values like admin tokens.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom color palettes (gold, navy, silver, etc.), border radius, and plugins including typography, container queries, and animations.",
  "project_state.json": "Tracks the current project state for the Aurelie Fine Jewellery app, documenting four in-progress UI features: removing cart button labels, filter icon navigation, recently viewed section, and shimmer border on product cards."
}