{
  "kind": "build_request",
  "title": "Remove Our Story strip, verify product page filters/nav, add category product rows on homepage",
  "projectName": "Aurelie Fine Jewellery",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove the 'Our Story' strip component (OurStoryStrip) from the homepage (HomePage.tsx). Delete all references to it in the page layout.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-5"
        ],
        "quotes": [
          "Remove the our story strip"
        ]
      },
      "acceptanceCriteria": [
        "The OurStoryStrip component is no longer rendered on the homepage",
        "No visual gap or empty space is left where the strip used to be",
        "The rest of the homepage layout remains unaffected"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure all product category pages (CategoryPageTemplate and all category-specific pages) include a functional filter bar (ProductFilterBar) with metal type, price range, occasion, and sort order filters, and a category navigation bar (HeaderCategoryNav) for switching between categories. If either is missing, add it.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-5"
        ],
        "quotes": [
          "Is the filter and navigation added in product pages?"
        ]
      },
      "acceptanceCriteria": [
        "Every product category page shows the ProductFilterBar with working filter controls",
        "A horizontal category navigation bar is visible on every product category page",
        "Selecting a filter updates the displayed product grid accordingly",
        "Clicking a category in the navigation bar routes to that category page"
      ]
    },
    {
      "id": "REQ-3",
      "text": "On the homepage, below each product category carousel section (rendered by HomeCategoryCarouselsSection or equivalent), add a horizontally scrollable row of small square product cards. Each row must show products belonging to the relevant category. Exactly 3 square cards should be visible on screen at a time. The scrollbar must be hidden (no visible scrollbar). Each card should display the product image, name, and price.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5",
          "msg-6"
        ],
        "quotes": [
          "below each product category carousel, let the product related to relevant carousel be displayed in small scrollable horizontal squares without a scroll bar. Like 3 square should be seen on screen at once."
        ]
      },
      "acceptanceCriteria": [
        "A horizontally scrollable product row appears below each category carousel section on the homepage",
        "Exactly 3 square product cards are visible at a time without needing to scroll",
        "No scrollbar is visible on the row (scrollbar hidden via CSS)",
        "Each card displays the product image cropped to a square aspect ratio, product name, and price in INR",
        "Only products belonging to the relevant category are shown in each row",
        "Clicking a product card navigates to that product's detail page",
        "The rows scroll smoothly by touch/swipe or mouse drag"
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui",
    "Backend schema must not change — no new backend endpoints are required; use existing product query hooks"
  ],
  "nonGoals": [
    "Admin editing of the Our Story strip (removed entirely)",
    "Adding new backend data models or migrations",
    "Infinite scroll or pagination for the category product rows",
    "Adding full product filtering to the homepage category rows"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}