{
  "backend/main.mo": "Main Motoko actor defining all data types (Product, Order, CustomerInquiry, Category, etc.) and storage maps for products, orders, inquiries, carousel slides, and categories with imports for blob storage, Stripe, HTTP outcalls, and authorization mixins.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components, pages, and hooks including routing, admin dashboard, product management, order management, category carousels, profile setup, and payment integration.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors for background, foreground, primary, secondary, borders, and sidebar components using oklch color space.",
  "frontend/index.html": "HTML entry point for the Aurelie Fine Jewellery mobile app with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main React app with TanStack Router setup defining all routes (home, product detail, categories, admin, orders, checkout, profile) with lazy loading, theme provider, and profile setup modal integration.",
  "frontend/src/components/admin/CarouselManagement.tsx": "Admin component for managing 5 homepage carousel slides with image upload, URL redirect configuration, enable/disable toggle, and reordering functionality. Includes image optimization and upload progress tracking.",
  "frontend/src/components/admin/CategoryCarouselManagement.tsx": "Admin component for managing category-specific carousel images (up to 5) with reordering, removal, and redirect URL configuration. Supports two carousel indices per category and includes image optimization.",
  "frontend/src/components/admin/CategoryImagesManager.tsx": "Reusable component for managing up to 10 category images with primary image selection, reordering (move up/down), removal, and upload progress tracking. Includes image optimization and automatic primary image assignment.",
  "frontend/src/components/admin/HeaderCategoryNavManagement.tsx": "Admin component for managing circular category images and redirect URLs displayed in the header navigation row. Handles image upload with optimization and progress tracking for each product category.",
  "frontend/src/components/admin/InquiryManagement.tsx": "Admin component for viewing and responding to customer inquiries with status badges (Pending/Answered) and inline response forms using textarea and toast notifications.",
  "frontend/src/components/admin/OrderManagement.tsx": "Admin component for managing orders with status updates (pending, confirmed, shipped, delivered, cancelled), order details display, and printable order receipts with formatted INR pricing.",
  "frontend/src/components/admin/ProductFormModal.tsx": "Modal dialog for creating/editing products with form fields for name, description, price, stock status, category, and media uploads (video and up to 5 images) with optimization utilities.",
  "frontend/src/components/admin/ProductManagement.tsx": "Admin component for managing product inventory with list view, add/edit/delete actions, stock status badges, and confirmation dialogs for deletions.",
  "frontend/src/components/admin/SiteContentManagement.tsx": "Admin form for editing site-wide content including contact information, about us, policies (terms, privacy, shipping, billing), disclaimers, and footer content.",
  "frontend/src/components/CategoryCarousel.tsx": "Reusable carousel component for displaying category slides with 16:9 aspect ratio, auto-rotation, navigation arrows, dot indicators, hover pause, and click-to-redirect functionality.",
  "frontend/src/components/CategoryImageCarousel.tsx": "Category-specific image carousel component that fetches carousel images and redirect URLs, displays them in 16:9 aspect ratio with auto-rotation, navigation controls, and optional click-through to redirect URL.",
  "frontend/src/components/checkout/CouponControl.tsx": "Checkout component for applying and removing coupon codes with inline validation, displaying applied coupon status, and showing 10% discount for valid codes.",
  "frontend/src/components/checkout/UpiQrCode.tsx": "React component that displays a UPI payment QR code using qrserver.com API and provides a button to copy the UPI URI to clipboard with toast notifications.",
  "frontend/src/components/CustomerPageStyleScope.tsx": "Simple wrapper component that adds a data-customer-page attribute to scope customer-facing page styles.",
  "frontend/src/components/footer/FooterSystem.tsx": "Footer component displaying site logo, contact information, policy links, and copyright notice with a caffeine.ai attribution link, using site content from backend queries.",
  "frontend/src/components/HeaderCategoryNav.tsx": "Renders a horizontal navigation bar with category icons/images that can redirect to category pages or custom URLs. Hides on admin routes and uses category header data from backend.",
  "frontend/src/components/HomeCarousel.tsx": "Auto-rotating image carousel component that displays enabled slides sorted by order, with manual navigation controls and click-through URL support. Pauses auto-rotation on hover.",
  "frontend/src/components/HomeCategoryCarouselsSection.tsx": "Displays a section with all product categories, each showing title, description, and two CategoryImageCarousel components. Iterates over PRODUCT_CATEGORIES constant.",
  "frontend/src/components/Layout.tsx": "Main application layout with sticky header containing logo, cart, and user authentication dropdown. Includes HeaderCategoryNav, footer, and admin link for authorized users.",
  "frontend/src/components/OrderDetailModal.tsx": "Modal dialog displaying order details with status badges, item list, and cancellation functionality. Allows users to cancel orders with reason selection if order is cancellable.",
  "frontend/src/components/ProductMediaCarousel.tsx": "Square aspect ratio carousel for product media (video first, then images) with navigation arrows and thumbnail dots. Handles video playback and lazy loading for images.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal component for initial user profile setup with fields for name, email, phone, and address. Grants admin access if the email matches 'aureliefinejewellery06@gmail.com' and prevents closing until profile is completed.",
  "frontend/src/components/RouteLoadingFallback.tsx": "Loading fallback component that displays skeleton placeholders (header and 3-column grid) while lazy-loaded route components are being loaded.",
  "frontend/src/components/StripeSetupModal.tsx": "Empty file with no content.",
  "frontend/src/hooks/useActor.ts": "React Query hook that manages the backend actor instance, creating it with the current Internet Identity and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminUiBodyAttribute.ts": "React hook that sets and removes the 'data-admin-ui' attribute on document.body to ensure Radix UI portals inherit admin-scoped styling.",
  "frontend/src/hooks/useCart.ts": "Zustand store with persistence for shopping cart management, providing methods to add, remove, update quantities, clear cart, and calculate totals.",
  "frontend/src/hooks/useCategoryCarouselQueries.ts": "React Query hooks for fetching and updating category carousel images and redirect URLs for specific category slugs and carousel indices.",
  "frontend/src/hooks/useCategoryHeaderNav.ts": "React Query hooks for fetching all category headers, getting a specific category header by slug, and updating category headers via backend actor.",
  "frontend/src/hooks/useFooterVariant.ts": "Simple hook that always returns 'split' as the footer variant without any state management or localStorage interaction.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for Internet Identity authentication, managing login state, identity persistence, and providing login/logout functionality with AuthClient integration.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating backend data including user profiles, admin checks, categories, carousels, products, orders, inquiries, and site content.",
  "frontend/src/index.css": "Global CSS file defining Tailwind configuration, OKLCH color system with Aurelie brand colors (bottle green, maroon, navy, gold, beige, silver), dark mode variants, and custom utilities for shimmering backgrounds, gold text, hairline dividers, and component styling.",
  "frontend/src/main.tsx": "Application entry point that renders the root React component with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Admin page for viewing and managing all orders with filtering by date/month/year, status updates, and detailed order information display including product names and cancellation reasons.",
  "frontend/src/pages/admin/CategoryEditPage.tsx": "Admin page for editing category details including name, description, display order, and managing category images with primary image selection.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page with access control, displaying stats overview (products, orders, inquiries) and tabbed management interfaces for products, orders, inquiries, site content, carousels, categories, and header navigation.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page showing cart items with quantity controls, remove functionality, and checkout button; requires authentication and displays empty state when cart is empty.",
  "frontend/src/pages/categories/AnkletsPage.tsx": "Empty file placeholder for Anklets category page.",
  "frontend/src/pages/categories/BridalJewelleryPage.tsx": "Empty file placeholder for Bridal Jewellery category page.",
  "frontend/src/pages/categories/CategoryNotFoundPage.tsx": "Empty file placeholder for category not found error page.",
  "frontend/src/pages/categories/CategoryPageTemplate.tsx": "Reusable template component for category pages that displays filtered products with add-to-cart, buy-now, and view-details functionality.",
  "frontend/src/pages/categories/EarringsPage.tsx": "Empty file placeholder for Earrings category page.",
  "frontend/src/pages/categories/LabGrownDiamondsJewelleryPage.tsx": "Lab-grown diamonds category page using CategoryPageTemplate with specific title and description for sustainable diamond jewellery.",
  "frontend/src/pages/categories/NecklacePage.tsx": "Empty file placeholder for Necklace category page.",
  "frontend/src/pages/categories/RingsPage.tsx": "Empty file placeholder for Rings category page.",
  "frontend/src/pages/CheckoutPage.tsx": "Two-step checkout page handling shipping address collection and UPI payment with coupon support, pricing calculations, QR code generation, and order creation upon payment confirmation.",
  "frontend/src/pages/ContactPage.tsx": "Contact form page allowing authenticated users to submit inquiries with name, email, and message fields.",
  "frontend/src/pages/CustomerDashboardPage.tsx": "Customer dashboard page displaying orders and inquiries in tabs, with stats cards, status badges, and order detail modal integration. Requires authentication and uses custom styling scope.",
  "frontend/src/pages/HomePage.tsx": "Main landing page featuring a hero carousel, category carousels section, and product catalog grid with add-to-cart and buy-now functionality.",
  "frontend/src/pages/OrdersPage.tsx": "Displays customer order history with status badges, order details, and modal for viewing individual orders. Requires authentication.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Empty file for payment failure handling (not yet implemented).",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Payment confirmation page showing success message, next steps, and navigation buttons to orders dashboard or home.",
  "frontend/src/pages/ProductCategoryPage.tsx": "Category-filtered product listing page with validation, product grid, and add-to-cart/buy-now actions requiring authentication.",
  "frontend/src/pages/ProductDetailPage.tsx": "Individual product detail page with media carousel, quantity selector, product info, and add-to-cart/buy-now buttons.",
  "frontend/src/pages/ProfileDetailsPage.tsx": "Profile details page allowing authenticated users to view and edit their personal information (name, email, phone, address, DOB) with validation and save functionality.",
  "frontend/src/utils/device.ts": "Device detection utility that determines if user is on mobile using modern navigator.userAgentData API with fallback to user agent string parsing.",
  "frontend/src/utils/mediaOptimization.ts": "Client-side media optimization utilities for resizing and compressing images before upload, with basic video preview support.",
  "frontend/src/utils/pricing.ts": "Centralized pricing utilities for cart calculations including subtotal, coupon validation (AFJ10 for 10% off), discount computation, and INR formatting.",
  "frontend/src/utils/productCategories.ts": "Defines product category types and a constant array of jewelry categories (necklace, earrings, rings, anklets, lab diamonds, bridal) with helper functions to retrieve, validate, and format category data.",
  "frontend/src/utils/upi.ts": "Provides utilities for generating UPI payment deep links for Indian payment apps (UPI, Google Pay, PhonePe) with hardcoded payee details for Aurelie Fine Jewellery.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and parameter cleanup capabilities.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes (including jewelry-themed colors like gold, navy, bottle-green), container settings, border radius variables, and extended theme properties using OKLCH color space.",
  "project_state.json": "Project metadata file indicating a pending feature request (AR-1) to retry deployment of the application to the Internet Computer network without code changes."
}