{
  "backend/main.mo": "Defines the main backend actor with product, category, order, inquiry, and site-content types plus in‑memory maps for storing them.",
  "backend/migration.mo": "Provides a migration that initializes a new categoryHeaders map on upgrade.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend files for reference or tooling.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables, light/dark palettes, and base styles.",
  "frontend/index.html": "Basic HTML entry point loading the React app from main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router routes, lazy loading, layout, and profile‑setup modal logic.",
  "frontend/src/components/admin/CarouselManagement.tsx": "Admin UI for managing homepage carousel slides, including uploads, ordering, and updates.",
  "frontend/src/components/admin/CategoryCarouselManagement.tsx": "Admin tool for managing up to five category carousel images and a redirect URL.",
  "frontend/src/components/admin/CategoryImagesManager.tsx": "Component for uploading, ordering, and selecting primary category images with optimization support.",
  "frontend/src/components/admin/HeaderCategoryNavManagement.tsx": "Manages header category navigation by letting admins upload optimized circular images and set redirect URLs for each category.",
  "frontend/src/components/admin/InquiryManagement.tsx": "Displays customer inquiries and allows admins to write and send responses, showing pending or answered status.",
  "frontend/src/components/admin/OrderManagement.tsx": "Fetches and displays orders, lets admins update order status, view product names, and generate printable order summaries.",
  "frontend/src/components/admin/ProductFormModal.tsx": "Modal form for creating or editing products, including media upload with optimization, category selection, and inventory settings.",
  "frontend/src/components/admin/ProductManagement.tsx": "Lists products with images and pricing, enabling admins to add, edit, or delete items via the product form modal and confirmation dialog.",
  "frontend/src/components/admin/SiteContentManagement.tsx": "Admin form component that loads site content, allows editing multiple text fields, and submits updates via mutation.",
  "frontend/src/components/CategoryCarousel.tsx": "Carousel component that loads category slides, auto‑rotates them, and handles click navigation.",
  "frontend/src/components/CategoryImageCarousel.tsx": "Carousel component for category images with auto-rotation, hover pause, navigation controls, and optional redirect clicks.",
  "frontend/src/components/checkout/CouponControl.tsx": "UI control for applying and removing coupon codes with inline validation and error messaging.",
  "frontend/src/components/checkout/UpiQrCode.tsx": "Generates and displays a UPI payment QR code and provides a copy-to-clipboard action.",
  "frontend/src/components/CustomerPageStyleScope.tsx": "Wrapper that applies a data attribute to scope customer page styles.",
  "frontend/src/components/footer/FooterSystem.tsx": "Footer component displaying logo, contact info, policies, dynamic year, and optional footer content from site settings.",
  "frontend/src/components/HeaderCategoryNav.tsx": "Renders a scrollable header navigation of product categories with optional redirect handling and icons.",
  "frontend/src/components/HomeCarousel.tsx": "Homepage carousel showing enabled slides with auto-rotation, directional transitions, and clickable redirects.",
  "frontend/src/components/HomeCategoryCarouselsSection.tsx": "Displays each product category with its description and two associated CategoryImageCarousels.",
  "frontend/src/components/Layout.tsx": "Main app layout with header, navigation, auth handling, cart display, and routed content outlet.",
  "frontend/src/components/OrderDetailModal.tsx": "Modal showing order details, status, and cancellation flow with reason selection and mutation handling.",
  "frontend/src/components/ProductMediaCarousel.tsx": "Displays product images and video in a carousel with navigation and lazy loading.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for collecting and saving initial user profile details with validation and backend submission.",
  "frontend/src/components/RouteLoadingFallback.tsx": "Skeleton-based loading placeholder for lazy-loaded routes.",
  "frontend/src/components/StripeSetupModal.tsx": "Empty placeholder file.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAdminUiBodyAttribute.ts": "Hook that toggles a data-admin-ui attribute on the document body for admin-specific styling.",
  "frontend/src/hooks/useCart.ts": "Zustand-powered cart store handling items, quantity updates, totals, and persistence.",
  "frontend/src/hooks/useCategoryCarouselQueries.ts": "React Query hooks for fetching and updating category carousel images and redirect URLs using the backend actor.",
  "frontend/src/hooks/useCategoryHeaderNav.ts": "React Query hooks for retrieving and updating category header data via the backend actor.",
  "frontend/src/hooks/useFooterVariant.ts": "Simple hook that always returns the 'split' footer variant.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context/provider and hook for managing authentication state, login, logout, and identity loading using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, admin status, categories, and carousel data using the actor and identity contexts.",
  "frontend/src/index.css": "Defines Tailwind base styles, custom OKLCH color variables, brand colors, utility classes, and component styling for the app’s theme.",
  "frontend/src/main.tsx": "Bootstraps the React app, providing React Query and Internet Identity providers around the root App component.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Admin interface for viewing, filtering, and updating order statuses with product lookup and date filters.",
  "frontend/src/pages/admin/CategoryEditPage.tsx": "Admin page for editing a category’s details, images, and display order with save and validation logic.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Renders the admin dashboard, checking admin status and displaying product, order, inquiry, and category stats with management interfaces.",
  "frontend/src/pages/CartPage.tsx": "Displays the user's cart, requiring authentication, and allows viewing items, modifying quantities, removing products, and navigating to checkout.",
  "frontend/src/pages/categories/AnkletsPage.tsx": "Empty placeholder page for an Anklets category.",
  "frontend/src/pages/categories/BridalJewelleryPage.tsx": "Empty placeholder page for a Bridal Jewellery category.",
  "frontend/src/pages/categories/CategoryNotFoundPage.tsx": "Empty placeholder page intended for displaying a missing category message.",
  "frontend/src/pages/categories/CategoryPageTemplate.tsx": "Reusable category page showing filtered products, handling cart actions, authentication checks, and navigation.",
  "frontend/src/pages/categories/EarringsPage.tsx": "Empty category page placeholder.",
  "frontend/src/pages/categories/LabGrownDiamondsJewelleryPage.tsx": "Renders the generic category template for lab-grown diamond jewellery.",
  "frontend/src/pages/categories/NecklacePage.tsx": "Empty category page placeholder.",
  "frontend/src/pages/categories/RingsPage.tsx": "Empty category page placeholder.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles checkout flow with address entry, coupon logic, UPI payment, and order creation. Redirects unauthenticated users or empty carts and manages pricing calculations.",
  "frontend/src/pages/ContactPage.tsx": "Provides an authenticated contact form for submitting inquiries. Validates input and sends customer inquiries via mutation.",
  "frontend/src/pages/CustomerDashboardPage.tsx": "Displays customer dashboard with order and inquiry summaries, status tags, and order detail modal. Requires login and fetches user orders and inquiries.",
  "frontend/src/pages/HomePage.tsx": "Shows homepage with carousel, category carousels, and product grid. Supports adding items to cart and navigating to product details or cart.",
  "frontend/src/pages/OrdersPage.tsx": "Lists customer orders with status indicators and detail modal. Requires authentication and loads both orders and product data.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Empty placeholder page for payment failure handling.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Shows payment success message with next steps and navigation to dashboard or home.",
  "frontend/src/pages/ProductCategoryPage.tsx": "Displays products for a given category, validates the category slug, filters products, and provides cart and navigation actions.",
  "frontend/src/pages/ProductDetailPage.tsx": "Shows detailed product info with media, price, stock, quantity controls, and actions to add to cart or buy.",
  "frontend/src/pages/ProfileDetailsPage.tsx": "Loads and edits the authenticated user's profile with validation and save functionality.",
  "frontend/src/utils/device.ts": "Detects whether the user is on a mobile device using userAgentData or fallback regex.",
  "frontend/src/utils/mediaOptimization.ts": "Provides client-side image resizing/compression and basic video preview generation utilities.",
  "frontend/src/utils/pricing.ts": "Utility functions for cart pricing, coupon validation, discounts, INR formatting, and line‑item totals.",
  "frontend/src/utils/productCategories.ts": "Defines product category metadata and helpers to validate, lookup, and list categories.",
  "frontend/src/utils/upi.ts": "Builds UPI deep links and generates service‑specific URIs for payments.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters with sessionStorage fallback.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, containers, and plugins.",
  "project_state.json": "Defines current project state for an e-commerce site, including features, admin behavior, known issues, and new feature requests. Used as structured metadata for build planning and tracking feature versions."
}