{
  "backend/main.mo": "Defines core types and in‑canister storage for products, orders, inquiries, carousel slides, user profiles, and site content.",
  "feature_evidence.json": "Feature evidence report referencing files and components relevant to overriding the logo button background style.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend components, pages, hooks, and admin modules.",
  "frontend/index.css": "Global Tailwind CSS setup defining theme variables, dark mode values, and base element styling.",
  "frontend/index.html": "Base HTML template mounting the React app and loading the main entry script.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, theme provider, layout wrapper, and triggers profile setup modal for new authenticated users.",
  "frontend/src/components/admin/CarouselManagement.tsx": "Admin tool to view, upload, optimize, reorder, and update carousel slide images and links.",
  "frontend/src/components/admin/CategoryCarouselManagement.tsx": "Manages category carousel slides, including uploading/optimizing images, editing URLs, toggling visibility, and reordering slots. Uses backend mutations to save updated slide data.",
  "frontend/src/components/admin/InquiryManagement.tsx": "Displays customer inquiries and allows admins to send responses via a simple text interface. Supports viewing message details and marking inquiries as answered.",
  "frontend/src/components/admin/OrderManagement.tsx": "Shows customer orders with status controls, product lookup, and formatted pricing/date helpers. Supports updating order status and printing detailed order sheets.",
  "frontend/src/components/admin/ProductFormModal.tsx": "Modal form for creating or editing products with fields for details and media, including optimized image/video uploads and preview management. Handles both new product creation and updating existing media.",
  "frontend/src/components/admin/ProductManagement.tsx": "Displays the product inventory list with CRUD controls for adding, editing, and deleting products. Integrates the product form modal and shows product thumbnails with formatted pricing.",
  "frontend/src/components/admin/SiteContentManagement.tsx": "Admin form for loading, editing, and saving site-wide contact details and static content via hooks.",
  "frontend/src/components/CategoryCarousel.tsx": "Category carousel component with auto-rotation, hover pause, slide transitions, and enabled-slide filtering.",
  "frontend/src/components/CustomerPageStyleScope.tsx": "Wrapper component adding a data attribute to scope customer-facing page styles.",
  "frontend/src/components/footer/FooterSystem.tsx": "Renders a split-layout footer showing branding, contact info, policy links, and optional footer text.",
  "frontend/src/components/HomeCarousel.tsx": "Homepage 16:9 carousel with auto-rotation, hover pause, directional slide transitions, and enabled-slide filtering.",
  "frontend/src/components/Layout.tsx": "Main layout with header, auth handling, cart badge, navigation, scroll shrink behavior, and route outlet.",
  "frontend/src/components/OrderDetailModal.tsx": "Modal showing order details, status, pricing, and supports order cancellation with reasons.",
  "frontend/src/components/ProductMediaCarousel.tsx": "Carousel displaying product images and video with navigation arrows and slide switching.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for collecting and saving initial user profile info with validation and backend submission.",
  "frontend/src/components/RouteLoadingFallback.tsx": "Skeleton-based loading placeholder for lazy-loaded routes.",
  "frontend/src/components/StripeSetupModal.tsx": "Empty placeholder file for Stripe setup modal.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries on change.",
  "frontend/src/hooks/useAdminUiBodyAttribute.ts": "Adds and removes a body attribute to enable admin-specific styling when mounted.",
  "frontend/src/hooks/useCart.ts": "Zustand store for cart items with persistence, providing add, remove, update, and total calculation methods.",
  "frontend/src/hooks/useFooterVariant.ts": "Returns a fixed footer variant value of 'split' with no state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for Internet Identity authentication, exposing identity state and login/logout handling.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping backend actor calls for user profiles, admin checks, carousel slides, and related mutations.",
  "frontend/src/index.css": "Defines Tailwind layers and an extensive set of CSS custom properties for light and dark themes, including brand color palettes and UI styling tokens.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Renders the admin dashboard with access control, stats summaries, and management tabs for products, orders, inquiries, content, and carousels.",
  "frontend/src/pages/CartPage.tsx": "Displays the authenticated user's cart with item management, price formatting, and navigation to checkout or browsing.",
  "frontend/src/pages/CheckoutPage.tsx": "Implements a two-step checkout flow for address and payment, auto-filling profile data and creating orders for each cart item.",
  "frontend/src/pages/ContactPage.tsx": "Provides an authenticated inquiry submission form that sends customer messages to the backend.",
  "frontend/src/pages/CustomerDashboardPage.tsx": "Renders the customer dashboard with order and inquiry data, authentication checks, and an order detail modal.",
  "frontend/src/pages/HomePage.tsx": "Displays homepage carousels and product grid with add‑to‑cart and buy‑now actions gated by authentication.",
  "frontend/src/pages/OrdersPage.tsx": "Empty placeholder page.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Empty placeholder page.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Empty placeholder page.",
  "frontend/src/pages/ProductDetailPage.tsx": "Shows product details, media carousel, and cart or purchase interactions with authentication checks.",
  "frontend/src/utils/mediaOptimization.ts": "Provides client‑side image resizing/compression and basic video preview generation utilities.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters and session‑stored values.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, containers, and plugin setup for the project.",
  "project_state.json": "Defines the project’s current state, including schema version, existing features, and a pending header update request. Tracks project metadata and clarification settings."
}