{
  "backend/main.mo": "Defines core types and in-memory maps for products, orders, inquiries, carousels, categories, user profiles, and site content in a Motoko actor.",
  "feature_evidence.json": "Lists feature evidence with related files, components, and test IDs for checkout coupon, UPI payments, and order total alignment features.",
  "frontend-file-summaries.txt": "Provides human‑written summaries of major frontend files including pages, components, hooks, and admin tools.",
  "frontend/index.css": "Tailwind CSS base layer defining color tokens, themes, and global styles for light and dark modes.",
  "frontend/index.html": "Base HTML file bootstrapping the React SPA by loading main.tsx into the root div.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, theme provider, layout, profile setup modal, and lazy‑loaded pages.",
  "frontend/src/components/admin/CarouselManagement.tsx": "Admin UI for managing up to five carousel slides, including image upload, optimization, editing, reordering, and enabling/disabling.",
  "frontend/src/components/admin/CategoryCarouselManagement.tsx": "Admin interface for editing category-specific carousels with image slots, optimization, uploads, and batch save.",
  "frontend/src/components/admin/InquiryManagement.tsx": "Admin tool to view customer inquiries and send responses, with indicators for pending and answered messages.",
  "frontend/src/components/admin/OrderManagement.tsx": "Admin dashboard for viewing orders, updating order statuses, formatting details, and printing order summaries.",
  "frontend/src/components/admin/ProductFormModal.tsx": "Modal form for creating or editing products, handling text fields, category, stock, and media upload with optimization and previews.",
  "frontend/src/components/admin/ProductManagement.tsx": "Admin interface to list, create, edit, and delete products with modal integration and confirmation dialogs.",
  "frontend/src/components/admin/SiteContentManagement.tsx": "Form-based admin panel for editing site-wide content such as contact info, policies, and static text.",
  "frontend/src/components/CategoryCarousel.tsx": "Category carousel component that fetches category slides, filters enabled ones, and renders an auto‑rotating, hover‑pausing slider with navigation controls.",
  "frontend/src/components/CategoryImageCarousel.tsx": "A category-specific 1:1 image carousel with auto-rotation, hover pause, slide navigation, and loading skeletons.",
  "frontend/src/components/checkout/CouponControl.tsx": "Checkout widget to apply or remove coupon codes with inline validation and status display.",
  "frontend/src/components/checkout/UpiQrCode.tsx": "Generates and displays a UPI payment QR code and allows copying the UPI link.",
  "frontend/src/components/CustomerPageStyleScope.tsx": "A wrapper component that adds a data attribute to scope customer page styles.",
  "frontend/src/components/footer/FooterSystem.tsx": "Footer component rendering branding, contact info, policy links, and optional footer text.",
  "frontend/src/components/HomeCarousel.tsx": "A homepage 16:9 carousel that fetches slides, auto-rotates, supports hover pause, ordering, and click redirects.",
  "frontend/src/components/Layout.tsx": "The main site layout with header navigation, auth handling, category routing, scroll-based header compression, and global footer.",
  "frontend/src/components/OrderDetailModal.tsx": "A modal showing order details with status display, cancellation flow, and reason input handling.",
  "frontend/src/components/ProductMediaCarousel.tsx": "A product media carousel displaying video then images with slide navigation and a square aspect ratio.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal form that collects and saves a user's profile, updates related queries, and shows feedback to the user.",
  "frontend/src/components/RouteLoadingFallback.tsx": "Skeleton-based loading placeholder used while lazy-loaded routes are fetched.",
  "frontend/src/components/StripeSetupModal.tsx": "Empty placeholder file for a Stripe setup modal component.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user’s identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAdminUiBodyAttribute.ts": "Sets a data-admin-ui attribute on the document body while active to enable admin‑scoped styling.",
  "frontend/src/hooks/useCart.ts": "Zustand store for cart items with add, remove, quantity updates, totals, and persisted storage.",
  "frontend/src/hooks/useCategoryCarouselQueries.ts": "React Query hooks to fetch and update category‑specific carousel images using the backend actor.",
  "frontend/src/hooks/useFooterVariant.ts": "Returns a fixed footer variant value of 'split'.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, login/clear actions, and loads or restores identity using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profile, admin status, carousels, categories, products, orders, and related mutations.",
  "frontend/src/index.css": "Tailwind setup defining extensive color and theme variables for light and dark modes.",
  "frontend/src/main.tsx": "App entrypoint initializing React, QueryClient, identity provider, and global styles.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page showing stats and management tabs, gated by admin access checks.",
  "frontend/src/pages/CartPage.tsx": "Displays the shopping cart, handling authentication, empty cart states, item quantity updates, removal, and price formatting.",
  "frontend/src/pages/categories/AnkletsPage.tsx": "Empty file intended to define the Anklets category page.",
  "frontend/src/pages/categories/BridalJewelleryPage.tsx": "Empty file intended to define the Bridal Jewellery category page.",
  "frontend/src/pages/categories/CategoryNotFoundPage.tsx": "Empty file intended to define a fallback page for invalid category routes.",
  "frontend/src/pages/categories/CategoryPageTemplate.tsx": "Reusable template for category pages that filters products, displays carousels, and supports cart and buy-now interactions.",
  "frontend/src/pages/categories/EarringsPage.tsx": "Empty file intended to define the Earrings category page.",
  "frontend/src/pages/categories/LabGrownDiamondsJewelleryPage.tsx": "Uses the category template to render the lab-grown diamonds jewellery category.",
  "frontend/src/pages/categories/NecklacePage.tsx": "Empty file intended to define the Necklace category page.",
  "frontend/src/pages/categories/RingsPage.tsx": "Empty file intended to define the Rings category page.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles multi‑step checkout with address entry, coupon logic, pricing calculation, and UPI payment initiation before order creation.",
  "frontend/src/pages/ContactPage.tsx": "Provides an authenticated contact form for submitting customer inquiries to the backend.",
  "frontend/src/pages/CustomerDashboardPage.tsx": "Shows authenticated users their orders and inquiries, with order status display and modal details.",
  "frontend/src/pages/HomePage.tsx": "Home page showing carousels, product listings, and actions for adding items to cart or navigating to product details.",
  "frontend/src/pages/OrdersPage.tsx": "Empty placeholder page.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Empty placeholder page.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Empty placeholder page.",
  "frontend/src/pages/ProductCategoryPage.tsx": "Renders a category page that filters products by slug, shows carousels, and supports add-to-cart and buy-now actions with auth checks.",
  "frontend/src/pages/ProductDetailPage.tsx": "Displays a single product with media carousel, quantity controls, and purchase actions, handling loading, missing data, and auth states.",
  "frontend/src/utils/device.ts": "Provides mobile-device detection using navigator.userAgentData with a user-agent fallback.",
  "frontend/src/utils/mediaOptimization.ts": "Implements client-side image resizing/compression and basic video preview generation for media uploads.",
  "frontend/src/utils/pricing.ts": "Utility module for cart pricing, coupon validation, discounts, line totals, and INR formatting.",
  "frontend/src/utils/productCategories.ts": "Defines product categories and provides helpers to validate slugs, retrieve categories, and generate select options.",
  "frontend/src/utils/upi.ts": "Generates UPI deep links, including a helper for Aurelie Fine Jewellery payments.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters (including hash routing), storing and retrieving them from sessionStorage, and persisting or clearing parameters across navigations.",
  "frontend/tailwind.config.js": "Configures Tailwind styling, theme extensions, colors, container settings, and includes typography, container-queries, and animation plugins.",
  "project_state.json": "Defines the project state for an e-commerce checkout system, including UPI payment and coupon features with their requirements and metadata."
}