{
  "backend/main.mo": "Motoko canister implementing the core backend for an e-commerce app, defining domain types (products, orders, media, inquiries, site content, users) and in-memory storage maps with constants for cancellation windows and media limits.",
  "feature_evidence.json": "Machine-readable report documenting completed styling features, listing feature IDs, descriptions, affected files, component dependencies, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten high-level summaries of all major frontend React components, pages, hooks, and admin modules for reference and planning.",
  "frontend/index.css": "Global Tailwind CSS base configuration defining design tokens, light/dark theme variables, and default background, border, and text styles used across the app.",
  "frontend/index.html": "HTML entry point for the React app that mounts the root element and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Main React application entry configuring TanStack Router routes, global layout, theme provider, toaster notifications, and profile setup flow after authentication.",
  "frontend/src/components/admin/CarouselManagement.tsx": "Admin interface for managing homepage carousel slides, including image upload, URL editing, enable/disable toggles, reordering, and persistence via backend mutations.",
  "frontend/src/components/admin/InquiryManagement.tsx": "Admin UI for viewing customer inquiries, showing pending/answered status, and sending text responses via mutations with toast feedback.",
  "frontend/src/components/admin/OrderManagement.tsx": "Admin dashboard for viewing orders, updating order status, formatting prices/dates, and printing detailed order invoices in a new window.",
  "frontend/src/components/admin/ProductFormModal.tsx": "Modal form used to add or edit products, managing name, description, price, stock status, and media uploads (images/videos) with previews and limits.",
  "frontend/src/components/admin/ProductManagement.tsx": "Admin interface to list products, open the product form for add/edit, display basic product info, and delete products with confirmation dialogs.",
  "frontend/src/components/admin/SiteContentManagement.tsx": "Admin form for editing static site content such as contact details, policies, footer text, and general information, backed by fetch/update hooks.",
  "frontend/src/components/HomeCarousel.tsx": "Homepage carousel component that fetches enabled slides, auto-rotates with hover pause, supports navigation controls, and links slides to external URLs with animated transitions.",
  "frontend/src/components/Layout.tsx": "Defines the main app layout with a sticky header, navigation, authentication handling, and conditional links for cart, dashboard, and admin based on user state.",
  "frontend/src/components/OrderDetailModal.tsx": "Modal dialog that displays detailed order information, status badges, and allows users to cancel eligible orders with a selected reason.",
  "frontend/src/components/ProductMediaCarousel.tsx": "Carousel component that displays a product’s video (if any) and images with navigation arrows and dots in a square aspect ratio.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal form that forces new users to complete their profile and saves it via the backend actor, updating related queries and admin status.",
  "frontend/src/components/StripeSetupModal.tsx": "File present but contains no implementation or exported component.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches a backend actor based on the current identity, initializes admin access control, and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useCart.ts": "Defines a Zustand store for shopping cart state with persistent storage, supporting add/remove/update items and computing total item count and total price.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements a React context and provider for Internet Identity authentication, managing login/logout, persisted identity loading, and detailed login status flags.",
  "frontend/src/hooks/useQueries.ts": "Provides a collection of React Query hooks for fetching and mutating backend data (users, admin status, products, orders, carousel slides, etc.) using an actor and identity context.",
  "frontend/src/index.css": "Sets up Tailwind CSS and defines an extensive set of CSS variables for light and dark themes, establishing the luxury color palette and design tokens used across the app.",
  "frontend/src/main.tsx": "Application entry point that renders the React app, wiring up React Query and Internet Identity providers and importing global styles.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Renders the admin dashboard with access control, summary statistics, and tabbed management views for products, orders, inquiries, site content, and carousel slides.",
  "frontend/src/pages/CartPage.tsx": "Displays the authenticated user's shopping cart, handling empty and unauthenticated states, item quantity management, removal, and total price presentation.",
  "frontend/src/pages/CheckoutPage.tsx": "Implements a multi-step checkout flow that collects shipping address, processes UPI payment details, creates orders for cart items, and redirects based on authentication and cart state.",
  "frontend/src/pages/ContactPage.tsx": "Provides an authenticated contact form allowing logged-in users to submit customer inquiries, with validation, submission via backend mutation, and success/error feedback.",
  "frontend/src/pages/CustomerDashboardPage.tsx": "Displays an authenticated customer dashboard with tabs for orders and inquiries, order status summaries, and an order detail modal for viewing individual order information.",
  "frontend/src/pages/HomePage.tsx": "Renders the home page with a product carousel and product grid, allowing authenticated users to add items to the cart or navigate to product details.",
  "frontend/src/pages/OrdersPage.tsx": "Empty or placeholder file intended for an orders listing or management page.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Empty or placeholder file intended to display payment failure feedback to the user.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Empty or placeholder file intended to display payment success confirmation after checkout.",
  "frontend/src/pages/ProductDetailPage.tsx": "Shows detailed information for a single product with media carousel, pricing, stock status, and actions to add to cart or buy now for authenticated users.",
  "frontend/src/utils/urlParams.ts": "Provides utilities to read URL parameters from query strings or hash-based routing, persist them to sessionStorage, and retrieve or clear them across navigation. Includes helpers for prioritizing URL values over stored values and safely managing sensitive parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode behavior, content scanning paths, container settings, and an extended theme with a large custom color palette, radii, shadows, and plugin integrations for typography, container queries, and animations.",
  "project_state.json": "Machine-readable snapshot of the project’s current state, including schema/versioning, a high-level product summary, and a catalog of implemented features spanning ICP backend canisters, RBAC, authentication, frontend architecture, and e-commerce functionality."
}