{
  "backend/main.mo": "Main canister defines product, order, inquiry, carousel, user profile, and site content types with in‑memory maps for storage and constants for media and cancellation windows.",
  "backend/migration.mo": "Migration module transforms old product records to include the new category field and maps old actor state to the updated structure.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of all key frontend files.",
  "frontend/index.css": "Tailwind base theme with extensive CSS variables for light and dark modes and global styling.",
  "frontend/index.html": "HTML entry point mounting the app root and loading the main TypeScript bundle.",
  "frontend/src/App.tsx": "App router and layout setup using TanStack Router with lazy-loaded pages, theme provider, and profile setup modal logic.",
  "frontend/src/components/admin/CarouselManagement.tsx": "Admin interface for editing up to five homepage carousel slides, including image upload, optimization, URL updates, and ordering.",
  "frontend/src/components/admin/CategoryCarouselManagement.tsx": "Admin tool for uploading, replacing, or removing category carousel images with optimization and batched saving.",
  "frontend/src/components/admin/InquiryManagement.tsx": "Admin panel for viewing customer inquiries and sending responses, with inline replying and status indicators.",
  "frontend/src/components/admin/OrderManagement.tsx": "Displays orders, formats details, updates order statuses, and provides printable order views.",
  "frontend/src/components/admin/ProductFormModal.tsx": "Modal form for creating or editing products with media upload, optimization, and validation.",
  "frontend/src/components/admin/ProductManagement.tsx": "Lists products with edit and delete actions and opens the product form modal for management.",
  "frontend/src/components/admin/SiteContentManagement.tsx": "Form to view and update site-wide content such as contact info, policies, and static text.",
  "frontend/src/components/CategoryCarousel.tsx": "Renders an auto-rotating category carousel with hover pause, navigation, and slide transitions based on fetched category slides.",
  "frontend/src/components/CategoryImageCarousel.tsx": "Displays a category-specific image carousel with auto-rotation, hover pause, and validation for category slugs.",
  "frontend/src/components/CustomerPageStyleScope.tsx": "Wraps children in a scoped div used to style customer-facing pages.",
  "frontend/src/components/footer/FooterSystem.tsx": "Footer component showing brand lockup, contact info, policies, and optional footer text.",
  "frontend/src/components/HomeCarousel.tsx": "Implements the homepage carousel with auto-play, slide transitions, loading skeleton, and click-through behavior.",
  "frontend/src/components/Layout.tsx": "Defines the main site layout with header navigation, authentication handling, category routing, and footer integration.",
  "frontend/src/components/OrderDetailModal.tsx": "Modal showing order details, status, and cancellation flow with reason selection and backend mutation.",
  "frontend/src/components/ProductMediaCarousel.tsx": "Renders a carousel that displays video first then images, with navigation and lazy loading. Handles empty media and manages active slide state.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal form for collecting and saving user profile data with validation and query invalidation. Displays toasts and blocks closing until submission completes.",
  "frontend/src/components/RouteLoadingFallback.tsx": "Shows skeleton placeholders while lazy-loaded routes are fetched. Includes header and grid-style content skeletons.",
  "frontend/src/components/StripeSetupModal.tsx": "Placeholder file with no implemented component.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and invalidates dependent queries on change.",
  "frontend/src/hooks/useAdminUiBodyAttribute.ts": "Adds a body attribute to enable admin-specific styling while admin routes are active.",
  "frontend/src/hooks/useCart.ts": "Zustand store managing cart items with add, remove, update, clear, and total calculation, persisted in storage.",
  "frontend/src/hooks/useCategoryCarouselQueries.ts": "React Query hooks for fetching and updating category-specific carousel images via actor API.",
  "frontend/src/hooks/useFooterVariant.ts": "Simple hook returning a constant 'split' footer variant.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling login, stored identity loading, and status tracking using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profiles, admin checks, carousel operations, and various backend data fetch/mutation actions.",
  "frontend/src/index.css": "Tailwind base plus extensive CSS variables defining a luxury-themed color system for light and dark modes.",
  "frontend/src/main.tsx": "App entry point initializing React, QueryClientProvider, and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page showing access control, statistics, and management tabs for products, orders, inquiries, and content.",
  "frontend/src/pages/CartPage.tsx": "Displays the user's cart, handles login gating, shows cart items with quantity controls, pricing, and navigation to checkout or products.",
  "frontend/src/pages/categories/AnkletsPage.tsx": "Empty placeholder page file for the Anklets category.",
  "frontend/src/pages/categories/BridalJewelleryPage.tsx": "Empty placeholder page file for the Bridal Jewellery category.",
  "frontend/src/pages/categories/CategoryNotFoundPage.tsx": "Empty placeholder page file for a category-not-found view.",
  "frontend/src/pages/categories/CategoryPageTemplate.tsx": "Reusable template for category pages with product grid, carousels, and cart interactions.",
  "frontend/src/pages/categories/EarringsPage.tsx": "Empty placeholder page file for the Earrings category.",
  "frontend/src/pages/categories/LabGrownDiamondsJewelleryPage.tsx": "Category page using the template to show lab-grown diamond jewellery items.",
  "frontend/src/pages/categories/NecklacePage.tsx": "Empty placeholder page file for the Necklace category.",
  "frontend/src/pages/categories/RingsPage.tsx": "Empty placeholder page file for the Rings category.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles the checkout flow including address entry, UPI payment, order creation, and cart clearing with authentication enforcement.",
  "frontend/src/pages/ContactPage.tsx": "Provides an authenticated contact form allowing users to submit inquiries with name, email, and message via backend mutation.",
  "frontend/src/pages/CustomerDashboardPage.tsx": "Shows authenticated users their orders and inquiries with status indicators and order detail modal support.",
  "frontend/src/pages/HomePage.tsx": "Displays homepage carousels and product listings with add‑to‑cart and buy‑now actions requiring login.",
  "frontend/src/pages/OrdersPage.tsx": "Empty placeholder file for an orders page.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Empty placeholder file for a payment failure page.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Empty placeholder file for a payment success page.",
  "frontend/src/pages/ProductCategoryPage.tsx": "Displays products for a given category with carousels, authentication checks, and cart actions.",
  "frontend/src/pages/ProductDetailPage.tsx": "Shows detailed product info with media carousel, quantity controls, and purchase/cart actions.",
  "frontend/src/utils/mediaOptimization.ts": "Provides client-side image resizing/compression and basic video preview handling.",
  "frontend/src/utils/productCategories.ts": "Defines product categories and helper functions for category lookup and validation.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters with session persistence.",
  "frontend/tailwind.config.js": "Configures Tailwind theme with extended OKLCH-based color system, container settings, plugins, and custom radii and shadows.",
  "project_state.json": "Defines current project state for UI updates, listing implemented features and pending requests related to header label, dropdown transparency, and category carousels."
}