{
  "backend/main.mo": "Defines product, order, inquiry, site content, and user profile types with in-memory maps for storage and constants for media and cancellation windows.",
  "feature_evidence.json": "Feature evidence report listing feature definitions, related components, files, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of multiple frontend files describing functionality for pages, components, hooks, and admin tools.",
  "frontend/index.css": "Tailwind base theme variables and dark-mode variants defining global colors, radii, and component tokens.",
  "frontend/index.html": "HTML entry point mounting the root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, theme provider, authentication profile checks, and renders the main layout.",
  "frontend/src/components/admin/CarouselManagement.tsx": "Admin interface to upload, reorder, enable/disable, and update carousel slides with image uploads.",
  "frontend/src/components/admin/InquiryManagement.tsx": "Admin tool to view customer inquiries and send responses using mutation hooks.",
  "frontend/src/components/admin/OrderManagement.tsx": "Admin interface to view orders, update their status, and print formatted order details.",
  "frontend/src/components/admin/ProductFormModal.tsx": "Modal form for creating or editing products, including media upload and preview handling.",
  "frontend/src/components/admin/ProductManagement.tsx": "Displays product inventory with options to add, edit, or delete products using a modal and confirmations.",
  "frontend/src/components/admin/SiteContentManagement.tsx": "Form-based interface for editing and saving site-wide content such as contact info and policies.",
  "frontend/src/components/footer/FooterSystem.tsx": "Footer component showing branding, contact info, policy links, and optional custom footer text.",
  "frontend/src/components/HomeCarousel.tsx": "Interactive auto-rotating homepage carousel that filters enabled slides, supports manual navigation, and links slides via URL redirects.",
  "frontend/src/components/Layout.tsx": "Transparent global layout header with scroll-compress behavior, branding assets, auth controls, cart badge, and footer rendering.",
  "frontend/src/components/OrderDetailModal.tsx": "Displays detailed order information, status, and cancellation flow with reason selection and mutation handling.",
  "frontend/src/components/ProductMediaCarousel.tsx": "Shows product media as a carousel supporting video and images with navigation arrows and dots.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for collecting and saving user profile details and invalidating related queries after submission.",
  "frontend/src/components/StripeSetupModal.tsx": "Empty placeholder component file for Stripe setup modal.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useCart.ts": "Zustand store for cart items with persist support, providing add, remove, update, and totals.",
  "frontend/src/hooks/useFooterVariant.ts": "Simple hook returning a constant footer variant of 'split'.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity login, state, and AuthClient integration.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating products, orders, inquiries, carousel slides, and user/admin data.",
  "frontend/src/index.css": "Tailwind base plus extensive custom CSS variables defining a luxury-themed color palette for light and dark modes.",
  "frontend/src/main.tsx": "App entry point initializing React, QueryClient, and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard showing stats and management tabs for products, orders, inquiries, site content, and carousel.",
  "frontend/src/pages/CartPage.tsx": "Cart page showing items, quantities, pricing, and requiring login before viewing or checking out.",
  "frontend/src/pages/CheckoutPage.tsx": "Implements a two-step checkout flow with address entry, UPI payment, and order creation for each cart item.",
  "frontend/src/pages/ContactPage.tsx": "Provides an authenticated contact form allowing users to submit inquiries to the backend.",
  "frontend/src/pages/CustomerDashboardPage.tsx": "Displays authenticated users’ orders and inquiries with status info and order detail modal support.",
  "frontend/src/pages/HomePage.tsx": "Fetches and displays products with add-to-cart and buy-now actions, plus a homepage carousel.",
  "frontend/src/pages/OrdersPage.tsx": "Empty placeholder page.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Empty placeholder page.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Empty placeholder page.",
  "frontend/src/pages/ProductDetailPage.tsx": "Shows detailed product info, media carousel, and lets authenticated users add to cart or proceed to checkout.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL or hash parameters, persist them in sessionStorage, and clear them from the hash for sensitive token handling.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, radii, shadows, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores the project’s versioned state, feature list, and summaries of implemented functionality for the ICP e‑commerce app."
}