{
  "backend/main.mo": "Defines the Motoko backend actor with product, category, carousel, orders, inquiries, and user profile types plus in-memory maps for storage.",
  "feature_evidence.json": "Feature evidence report listing implemented features, affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries for multiple frontend files describing their functionality, routes, components, and UI behavior.",
  "frontend/index.css": "Tailwind CSS setup defining base styles and light/dark theme CSS variables.",
  "frontend/index.html": "Minimal HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React router configuration with lazy-loaded pages, layout, profile setup modal logic, and route definitions including admin and category edit routes.",
  "frontend/src/components/admin/CarouselManagement.tsx": "Admin tool to upload, reorder, edit, and toggle carousel slides with image optimization and progress tracking.",
  "frontend/src/components/admin/CategoryCarouselManagement.tsx": "Manages category-specific carousel images and redirect URLs, supporting image uploads, reordering, and saving updates.",
  "frontend/src/components/admin/CategoryImagesManager.tsx": "Component for uploading, ordering, removing, and selecting a primary image for category image sets with optimization support.",
  "frontend/src/components/admin/InquiryManagement.tsx": "Admin interface that lists customer inquiries and allows sending responses with status updates.",
  "frontend/src/components/admin/OrderManagement.tsx": "Admin interface for viewing orders, updating statuses, formatting data, and printing order details.",
  "frontend/src/components/admin/ProductFormModal.tsx": "Modal form for creating or editing products, including media upload, optimization, and category selection.",
  "frontend/src/components/admin/ProductManagement.tsx": "Displays product inventory with options to add, edit, or delete products using a modal and confirmation dialog.",
  "frontend/src/components/admin/SiteContentManagement.tsx": "Form-based admin tool for editing static site content such as contact info, policies, and About Us text.",
  "frontend/src/components/CategoryCarousel.tsx": "Carousel component fetching category slides, filtering enabled slides, auto-rotating, and supporting navigation with image click redirects.",
  "frontend/src/components/CategoryImageCarousel.tsx": "Renders an auto-rotating category image carousel with hover pause, navigation controls, and optional redirect.",
  "frontend/src/components/checkout/CouponControl.tsx": "Checkout component for applying and removing coupon codes with inline validation and messaging.",
  "frontend/src/components/checkout/UpiQrCode.tsx": "Renders a UPI payment QR code and provides a copy-to-clipboard action for the UPI link.",
  "frontend/src/components/CustomerPageStyleScope.tsx": "Wraps children in a div used to scope customer page styling.",
  "frontend/src/components/footer/FooterSystem.tsx": "Renders the site footer with contact info, policies, dynamic site content, and a branded bottom bar.",
  "frontend/src/components/HomeCarousel.tsx": "Displays a home-page autoplaying slide carousel with sorting, transitions, hover pause, and click redirects.",
  "frontend/src/components/HomeCategoryCarouselsSection.tsx": "Shows a section of category descriptions and two image carousels for each product category.",
  "frontend/src/components/Layout.tsx": "Defines the main app layout with header navigation, authentication controls, cart indicator, and routed content.",
  "frontend/src/components/OrderDetailModal.tsx": "Modal for viewing order details, status, and submitting cancellation requests with reason selection.",
  "frontend/src/components/ProductMediaCarousel.tsx": "Displays product media (video and images) in a navigable square-aspect carousel with arrows.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal form that collects user profile fields, saves them through an actor, and triggers query invalidation and success toasts.",
  "frontend/src/components/RouteLoadingFallback.tsx": "Displays skeleton placeholders as a loading fallback for lazy‑loaded routes.",
  "frontend/src/components/StripeSetupModal.tsx": "Empty placeholder file for a Stripe setup modal component.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAdminUiBodyAttribute.ts": "Adds and removes a data-admin-ui attribute on the body to enable admin‑scoped styling.",
  "frontend/src/hooks/useCart.ts": "Provides a persistent Zustand-powered shopping cart with item management and total calculations.",
  "frontend/src/hooks/useCategoryCarouselQueries.ts": "Defines queries and mutations for reading and updating category carousel images and redirect URLs using the backend actor.",
  "frontend/src/hooks/useFooterVariant.ts": "Returns a fixed footer variant value of 'split'.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for managing authentication state, login, and stored identities.",
  "frontend/src/hooks/useQueries.ts": "Contains react‑query hooks for user profiles, admin checks, categories, and carousel slide CRUD via the backend actor.",
  "frontend/src/index.css": "Configures Tailwind and custom design tokens, colors, utilities, and component styles for the site.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Admin page for viewing, filtering, and updating order statuses with date and month/year filters.",
  "frontend/src/pages/admin/CategoryEditPage.tsx": "Admin page for editing category details, images, and saving updates via API.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard showing stats and management tabs for products, orders, inquiries, site content, and categories, with access restrictions for non-admins.",
  "frontend/src/pages/CartPage.tsx": "Displays and manages the user's shopping cart with item quantity controls, pricing, and authentication checks.",
  "frontend/src/pages/categories/AnkletsPage.tsx": "Empty category page placeholder for anklets.",
  "frontend/src/pages/categories/BridalJewelleryPage.tsx": "Empty category page placeholder for bridal jewellery.",
  "frontend/src/pages/categories/CategoryNotFoundPage.tsx": "Empty component placeholder for category-not-found UI.",
  "frontend/src/pages/categories/CategoryPageTemplate.tsx": "Template for category pages that loads products, filters by category, and provides cart and navigation actions.",
  "frontend/src/pages/categories/EarringsPage.tsx": "Empty category page placeholder for earrings.",
  "frontend/src/pages/categories/LabGrownDiamondsJewelleryPage.tsx": "Renders the lab-grown diamonds category using the shared template.",
  "frontend/src/pages/categories/NecklacePage.tsx": "Empty category page placeholder for necklaces.",
  "frontend/src/pages/categories/RingsPage.tsx": "Empty category page placeholder for rings.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles the checkout flow including address entry, coupon application, UPI payment handling, and final order creation.",
  "frontend/src/pages/ContactPage.tsx": "Provides a contact form for authenticated users to submit inquiries to the store, with validation and mutation handling.",
  "frontend/src/pages/CustomerDashboardPage.tsx": "Shows authenticated customers their orders and inquiries with status details and an order detail modal.",
  "frontend/src/pages/HomePage.tsx": "Displays homepage with hero carousel, category sections, and product grid with add-to-cart and buy-now actions.",
  "frontend/src/pages/OrdersPage.tsx": "Shows authenticated users their order history with statuses, product lookup, and a modal for order details.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Empty page placeholder with no implemented UI or logic.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Renders a success message after payment with next steps and navigation to orders or home.",
  "frontend/src/pages/ProductCategoryPage.tsx": "Lists products filtered by category slug, handling invalid categories, cart actions, and product navigation.",
  "frontend/src/pages/ProductDetailPage.tsx": "Displays detailed product information with media carousel, price, stock, quantity selection, and cart/buy actions.",
  "frontend/src/pages/ProfileDetailsPage.tsx": "Provides a profile editing form for authenticated users with validation and save functionality.",
  "frontend/src/utils/device.ts": "Utility to detect mobile devices using userAgentData with a fallback to userAgent regex.",
  "frontend/src/utils/mediaOptimization.ts": "Client-side utilities to resize, compress, and preview images and videos before upload.",
  "frontend/src/utils/pricing.ts": "Pricing utilities for subtotal, discounts, coupon validation, and currency formatting.",
  "frontend/src/utils/productCategories.ts": "Defines product categories and helpers for lookup and generating options.",
  "frontend/src/utils/upi.ts": "Generates UPI, Google Pay, and PhonePe payment deep links from amount and payee details.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), persist them in sessionStorage, and clear them from the hash. Also includes utilities for retrieving and removing stored session parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with dark mode, content paths, extended color palette, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s current state, feature scope, constraints, and known issues. Tracks implemented features and pending requests for admin and customer UI updates."
}