{
  "backend/main.mo": "Motoko backend defining product, order, user profile, carousel, and inquiry types with in‑memory maps for storage and site content defaults.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, affected files, components, tests, and confidence metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of key frontend React files.",
  "frontend/index.css": "Tailwind base and theme variable definitions for light and dark modes across the app.",
  "frontend/index.html": "Basic HTML entry point loading the React application root and main.tsx script.",
  "frontend/src/App.tsx": "Main React router setup with layout, lazy‑loaded pages, profile‑setup flow, and theme provider.",
  "frontend/src/components/admin/CarouselManagement.tsx": "Admin UI to upload, optimize, edit, reorder, and toggle homepage carousel slides.",
  "frontend/src/components/admin/CategoryCarouselManagement.tsx": "Admin tool for managing category‑specific carousel images and redirect URLs with image optimization.",
  "frontend/src/components/admin/InquiryManagement.tsx": "Admin interface to view customer inquiries and send responses.",
  "frontend/src/components/admin/OrderManagement.tsx": "Admin panel for viewing orders, changing order status, and printing formatted order details.",
  "frontend/src/components/admin/ProductFormModal.tsx": "Modal form for creating and editing products, handling text fields, media uploads, previews, and optimization before submitting via product mutations.",
  "frontend/src/components/admin/ProductManagement.tsx": "Admin interface to list, create, edit, and delete products, showing product cards and invoking the product form modal.",
  "frontend/src/components/admin/SiteContentManagement.tsx": "Form-based admin panel for viewing and updating site-wide static content such as contact info and policies.",
  "frontend/src/components/CategoryCarousel.tsx": "Client carousel component fetching category slides and providing autoplay, hover pause, transitions, and click redirects.",
  "frontend/src/components/CategoryImageCarousel.tsx": "A category-specific image carousel with auto-rotation, hover pause, navigation, and optional redirect behavior.",
  "frontend/src/components/checkout/CouponControl.tsx": "Checkout widget allowing users to apply or remove coupon codes with validation and feedback.",
  "frontend/src/components/checkout/UpiQrCode.tsx": "Generates and displays a UPI payment QR code and provides a copy-to-clipboard action.",
  "frontend/src/components/CustomerPageStyleScope.tsx": "Wraps children in a div with a data attribute to scope customer page styles.",
  "frontend/src/components/footer/FooterSystem.tsx": "Footer component showing branding, contact info, policies, dynamic footer text, and copyright details.",
  "frontend/src/components/HomeCarousel.tsx": "A homepage carousel that fetches slides, auto-rotates, supports navigation, and redirects on slide click.",
  "frontend/src/components/Layout.tsx": "Main site layout with header, navigation, authentication handling, category links, and footer.",
  "frontend/src/components/OrderDetailModal.tsx": "Modal for viewing order details, status, cancellation options, and performing order cancellation.",
  "frontend/src/components/ProductMediaCarousel.tsx": "Displays product videos and images in a carousel with navigation controls and square aspect ratio.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal form collecting basic user profile data and saving it via actor API with validation and query invalidation.",
  "frontend/src/components/RouteLoadingFallback.tsx": "Displays skeleton placeholders as a loading fallback for lazy‑loaded routes.",
  "frontend/src/components/StripeSetupModal.tsx": "Empty placeholder file for a Stripe setup modal component.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor based on user identity, initializing access control and invalidating dependent queries on change.",
  "frontend/src/hooks/useAdminUiBodyAttribute.ts": "Hook that toggles a body attribute to apply admin-specific styling while admin views are active.",
  "frontend/src/hooks/useCart.ts": "Zustand store for cart items with add, remove, update, clear, and total calculations, persisted in localStorage.",
  "frontend/src/hooks/useCategoryCarouselQueries.ts": "React Query hooks to fetch and update category carousel images and redirect URLs using an actor.",
  "frontend/src/hooks/useFooterVariant.ts": "Simple hook returning a constant 'split' footer variant.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hooks managing Internet Identity login, stored identities, and auth state via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for user profiles, admin checks, homepage and category carousels, and other backend data operations.",
  "frontend/src/index.css": "Tailwind setup defining theme variables, brand colors, utilities, and component styles including shimmering and gold effects.",
  "frontend/src/main.tsx": "App entry point that sets up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard displaying stats and management tabs, gated by admin access and populated via multiple data queries.",
  "frontend/src/pages/CartPage.tsx": "Displays the shopping cart, handling authentication, empty states, item listing, quantity updates, and removal.",
  "frontend/src/pages/categories/AnkletsPage.tsx": "Empty placeholder page for the Anklets category.",
  "frontend/src/pages/categories/BridalJewelleryPage.tsx": "Empty placeholder page for the Bridal Jewellery category.",
  "frontend/src/pages/categories/CategoryNotFoundPage.tsx": "Empty placeholder page for handling missing categories.",
  "frontend/src/pages/categories/CategoryPageTemplate.tsx": "Reusable template that displays a category header, carousels, and filtered products with cart actions.",
  "frontend/src/pages/categories/EarringsPage.tsx": "Empty placeholder page for the Earrings category.",
  "frontend/src/pages/categories/LabGrownDiamondsJewelleryPage.tsx": "Category page instance using the template for lab-grown diamond jewellery.",
  "frontend/src/pages/categories/NecklacePage.tsx": "Empty placeholder page for the Necklace category.",
  "frontend/src/pages/categories/RingsPage.tsx": "Empty placeholder page for the Rings category.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles the checkout flow including address entry, coupon logic, UPI payment options, and order creation.",
  "frontend/src/pages/ContactPage.tsx": "Provides a contact form for authenticated users to submit inquiries, with validation and backend submission.",
  "frontend/src/pages/CustomerDashboardPage.tsx": "Shows authenticated users their order history and inquiries with status indicators and order detail modal support.",
  "frontend/src/pages/HomePage.tsx": "Displays product listings with a carousel, allowing users to view items, add to cart, or buy now.",
  "frontend/src/pages/OrdersPage.tsx": "Empty placeholder page.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Empty placeholder page.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Shows a confirmation message after successful payment with navigation options to dashboard or home.",
  "frontend/src/pages/ProductCategoryPage.tsx": "Page displaying products filtered by category with carousels, authentication checks, and cart actions.",
  "frontend/src/pages/ProductDetailPage.tsx": "Product detail view with media carousel, quantity controls, cart actions, and category-based carousels.",
  "frontend/src/pages/ProfileDetailsPage.tsx": "Profile editing page that loads user data, validates input, and saves changes with authentication checks.",
  "frontend/src/utils/device.ts": "Utility to detect mobile devices using userAgentData with a user-agent fallback.",
  "frontend/src/utils/mediaOptimization.ts": "Client-side utilities to resize/compress images and generate preview URLs, with simple video handling.",
  "frontend/src/utils/pricing.ts": "Pricing helpers for cart subtotal, coupon validation, discount calculation, and INR formatting.",
  "frontend/src/utils/productCategories.ts": "Defines the ProductCategory interface and a list of category objects, plus helpers to fetch and validate categories and build select options.",
  "frontend/src/utils/upi.ts": "Provides functions to build standard and app-specific UPI payment URIs, including preset details for Aurelie Fine Jewellery.",
  "frontend/src/utils/urlParams.ts": "Implements utilities for reading URL and hash parameters, persisting them in sessionStorage, and managing stored values.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom themes, colors, container settings, and plugin integrations.",
  "project_state.json": "Describes project state and requirements for restoring the homepage carousel and updating Buy Now button text color."
}