{
  "backend/main.mo": "Main Motoko actor defining e-commerce data types (Product, Order, CustomerInquiry, Category, SiteContent with social media URLs), storage maps, and public API methods for managing products, orders, categories, carousels, user profiles, and site content with authorization, blob storage, and Stripe integration.",
  "backend/migration.mo": "Migration module that upgrades SiteContent from OldSiteContent to NewSiteContent by adding facebookUrl, instagramUrl, and xUrl fields with default values for Aurelie Fine Jewellery social media accounts.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: removing rectangular backgrounds from category circles, applying glow animations to category circles, adding social media icons to footer with admin-controlled URLs, creating admin settings panel for social media URLs, and adding clickable policy links in footer.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React files including App.tsx with routing, hooks for backend queries, Layout with header/footer, ProfileSetupModal, product pages, admin dashboard, category management, and various UI components with gold-themed styling.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color schemes using oklch color space for background, foreground, primary, secondary, accent, border, and sidebar colors.",
  "frontend/index.html": "HTML entry point for the Aurelie Fine Jewellery Mobile App with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main React application component with TanStack Router setup, lazy-loaded route components for home, products, cart, checkout, admin, customer orders, category pages, policy pages, ProfileSetupWrapper for first-time user setup, and QueryClient configuration with ThemeProvider.",
  "frontend/src/components/admin/CarouselManagement.tsx": "Admin interface for managing homepage carousel slides (5 slots) with image upload, URL redirect configuration, enable/disable toggle, and reordering. Includes image optimization and upload progress tracking.",
  "frontend/src/components/admin/CategoryCarouselManagement.tsx": "Admin component for managing category-specific carousel images (up to 5) with reordering, removal, and redirect URL configuration. Supports image optimization and tracks upload progress for new images.",
  "frontend/src/components/admin/CategoryImagesManager.tsx": "Manages category images with upload, reordering, deletion, and primary image selection. Supports up to 10 images with progress tracking and image optimization.",
  "frontend/src/components/admin/HeaderCategoryNavManagement.tsx": "Admin interface for managing circular category images and redirect URLs in the header navigation. Handles image uploads with optimization and progress tracking for each product category.",
  "frontend/src/components/admin/InquiryManagement.tsx": "Displays customer inquiries with status badges and allows admins to respond. Shows pending vs answered inquiries with message history.",
  "frontend/src/components/admin/OrderManagement.tsx": "Admin dashboard for viewing and managing orders with status updates (pending, confirmed, shipped, delivered, cancelled). Includes order printing functionality with formatted receipts.",
  "frontend/src/components/admin/ProductFormModal.tsx": "Modal form for creating and editing products with fields for name, description, price, stock status, category, and media (video and up to 5 images). Handles media optimization and preview generation.",
  "frontend/src/components/admin/ProductManagement.tsx": "Admin component for managing product inventory with CRUD operations (add, edit, delete) and displays products in a list with images, pricing, and stock status.",
  "frontend/src/components/admin/SiteContentManagement.tsx": "Admin form component for editing site-wide content including contact information, social media links, policies, and static text content with save functionality.",
  "frontend/src/components/CategoryCarousel.tsx": "Displays a carousel of slides for a specific category with auto-rotation, navigation controls, and click-to-redirect functionality. Fetches enabled slides from the backend, sorts by order, and pauses auto-rotation on hover.",
  "frontend/src/components/CategoryImageCarousel.tsx": "Renders a carousel of images for a category with configurable carousel index (1 or 2), supporting auto-rotation and optional redirect URL. Validates category slugs and filters out empty images before display.",
  "frontend/src/components/checkout/CouponControl.tsx": "Checkout component for applying and removing coupon codes with inline validation, displaying applied coupon status and 10% discount information.",
  "frontend/src/components/checkout/UpiQrCode.tsx": "Renders a scannable UPI payment QR code using qrserver.com API and provides a copy-to-clipboard button for the UPI URI.",
  "frontend/src/components/CustomerPageStyleScope.tsx": "A simple wrapper component that adds a data attribute 'data-customer-page=\"true\"' to scope styles for customer-facing pages.",
  "frontend/src/components/footer/FooterSystem.tsx": "Site footer component displaying logo, contact information, social media links, and policy navigation links using site content from backend.",
  "frontend/src/components/HeaderCategoryNav.tsx": "Displays a horizontal navigation bar with circular category icons and titles, fetching category headers from the backend. Handles navigation to category pages or custom redirect URLs when clicked.",
  "frontend/src/components/HomeCarousel.tsx": "Main homepage carousel component with slide transitions, auto-rotation, and directional animations (left/right). Fetches and displays enabled slides sorted by order with navigation controls and click-to-redirect.",
  "frontend/src/components/HomeCategoryCarouselsSection.tsx": "Renders a section displaying all product categories with their descriptions and two carousels per category. Iterates through PRODUCT_CATEGORIES and renders CategoryImageCarousel components for each.",
  "frontend/src/components/Layout.tsx": "Main application layout with sticky header containing logo, cart, and authentication controls. Includes Internet Identity login/logout, admin access check, category navigation, and footer system.",
  "frontend/src/components/OrderDetailModal.tsx": "Modal component displaying detailed order information including status, items, pricing, and delivery address. Supports order cancellation with reason selection and displays cancellation details for cancelled orders.",
  "frontend/src/components/ProductMediaCarousel.tsx": "Carousel component for displaying product media (video and images) with navigation arrows and dot indicators. Supports square aspect ratio display with lazy loading for non-adjacent slides.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal form for initial user profile setup requiring name, email, phone, and address. Grants admin access when using the specific admin email address and prevents closing until completed.",
  "frontend/src/components/RouteLoadingFallback.tsx": "Loading skeleton component displayed while lazy-loaded route components are being fetched. Shows placeholder skeletons for header and grid content layout.",
  "frontend/src/components/StripeSetupModal.tsx": "Empty file with no content.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with Internet Identity authentication and admin token initialization.",
  "frontend/src/hooks/useAdminUiBodyAttribute.ts": "Hook that sets data-admin-ui attribute on document.body for admin routes to enable scoped styling for Radix UI portals.",
  "frontend/src/hooks/useCart.ts": "Zustand store with persistence for shopping cart state management including add/remove items, quantity updates, and total calculations.",
  "frontend/src/hooks/useCategoryCarouselQueries.ts": "Provides React Query hooks for fetching and updating category-specific carousel images and redirect URLs, with automatic cache invalidation.",
  "frontend/src/hooks/useCategoryHeaderNav.ts": "Exports React Query hooks for fetching all category headers, individual category headers, and updating category header data with cache invalidation.",
  "frontend/src/hooks/useFooterVariant.ts": "Simple hook that always returns 'split' as the footer variant without any state management or localStorage interaction.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication with React context, providing login/logout functionality, identity management, and status tracking using DFINITY's AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Central collection of React Query hooks for user profiles, admin checks, categories, products, orders, inquiries, site content, and carousel management with mutations and cache invalidation.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with OKLCH color system for Aurelie brand colors (bottle green, maroon, navy, gold, beige, silver), animated gradients, glow effects, and custom utility classes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Admin page for viewing and managing orders with filtering by date/month/year, status updates, and detailed order information including products and customer details.",
  "frontend/src/pages/admin/CategoryEditPage.tsx": "Admin page for editing category details including name, description, display order, and managing category images with primary image selection.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page with tabs for managing products, orders, inquiries, site content, carousels, and category navigation, including access control and statistics overview.",
  "frontend/src/pages/CartPage.tsx": "Displays the shopping cart with item management (add/remove/update quantity), authentication checks, and navigation to checkout. Formats prices in INR and shows product images with quantity controls.",
  "frontend/src/pages/categories/AnkletsPage.tsx": "Category page for Anklets using the CategoryPageTemplate with slug 'anklets' and descriptive content.",
  "frontend/src/pages/categories/BridalJewelleryPage.tsx": "Category page for Bridal Jewellery using the CategoryPageTemplate with slug 'bridal-jewellery' and descriptive content.",
  "frontend/src/pages/categories/CategoryNotFoundPage.tsx": "Empty component file for handling category not found scenarios.",
  "frontend/src/pages/categories/CategoryPageTemplate.tsx": "Reusable template component for category pages that filters and displays products by category with add-to-cart, buy-now, and view-details functionality.",
  "frontend/src/pages/categories/EarringsPage.tsx": "Category page for Earrings using the CategoryPageTemplate with slug 'earrings' and descriptive content.",
  "frontend/src/pages/categories/LabGrownDiamondsJewelleryPage.tsx": "Category page for Lab-Grown Diamonds using the CategoryPageTemplate with slug 'lab-diamonds-jewellery' and descriptive content.",
  "frontend/src/pages/categories/NecklacePage.tsx": "Category page for Necklaces using the CategoryPageTemplate with slug 'necklace' and descriptive content.",
  "frontend/src/pages/categories/RingsPage.tsx": "Category page for Rings using the CategoryPageTemplate with slug 'rings' and descriptive content.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles two-step checkout flow (address entry and UPI payment) with coupon support, pricing calculations, and order creation. Generates UPI payment URIs for multiple payment apps and validates shipping information.",
  "frontend/src/pages/ContactPage.tsx": "Provides a contact form for authenticated users to submit customer inquiries with name, email, and message fields. Submits inquiries to the backend and displays success/error notifications.",
  "frontend/src/pages/CustomerDashboardPage.tsx": "Displays customer orders and inquiries in a tabbed interface with order status tracking, statistics overview, and detailed order modal. Shows order history with status badges and inquiry responses.",
  "frontend/src/pages/HomePage.tsx": "Main landing page featuring a hero carousel, category carousels section, and product catalog grid. Allows users to view products, add items to cart, or buy immediately with INR price formatting.",
  "frontend/src/pages/OrdersPage.tsx": "Displays a customer's order history with status badges, order details, and filtering. Includes a modal for viewing detailed order information and requires authentication.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows a payment failure message with options to return to cart or home page. Displays an error icon and helpful messaging for failed transactions.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Displays a payment success confirmation with next steps information and navigation buttons to view orders or return home. Shows a success icon and order tracking guidance.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Renders the site's privacy policy content fetched from backend site content. Shows loading state while fetching data.",
  "frontend/src/pages/ProductCategoryPage.tsx": "Displays products filtered by category slug with add-to-cart and buy-now functionality. Validates category slug and shows category header with description.",
  "frontend/src/pages/ProductDetailPage.tsx": "Shows detailed product information including media carousel, price, stock status, and quantity selector. Provides add-to-cart and buy-now actions with navigation back to products.",
  "frontend/src/pages/ProfileDetailsPage.tsx": "Allows authenticated users to view and edit their profile information including name, email, phone, address, and date of birth. Includes validation and save functionality with change tracking.",
  "frontend/src/pages/ShippingPolicyPage.tsx": "Renders the site's shipping policy content fetched from backend site content. Shows loading state while fetching data.",
  "frontend/src/pages/TermsConditionsPage.tsx": "Displays the Terms & Conditions page by fetching site content from the backend and rendering it with a loading state.",
  "frontend/src/utils/device.ts": "Utility for detecting mobile devices using modern navigator.userAgentData API with fallback to user agent string parsing.",
  "frontend/src/utils/mediaOptimization.ts": "Client-side utilities for optimizing images by resizing and compressing before upload, with basic video preview support.",
  "frontend/src/utils/pricing.ts": "Centralized pricing utilities for computing subtotals, validating coupons, calculating discounts, and formatting INR currency.",
  "frontend/src/utils/productCategories.ts": "Defines product category metadata (slug, title, description) and provides helper functions for category lookup and validation.",
  "frontend/src/utils/upi.ts": "Utility functions for generating UPI payment deep links for Indian payment apps (UPI, Google Pay, PhonePe) with hardcoded Aurelie Fine Jewellery payee details.",
  "frontend/src/utils/urlParams.ts": "URL parameter parsing utilities that work with hash-based and browser routing, including sessionStorage persistence for parameters like admin tokens.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color palette (bottle-green, blood-maroon, navy, gold, beige, silver) using OKLCH color space and extended theme settings.",
  "project_state.json": "Project state tracking document indicating pending UI fixes for category circles, social media icons in footer, admin settings panel, and policy page links that were deployed but not reflecting properly."
}