{
  "backend/main.mo": "Defines data types and in-memory maps for products, orders, inquiries, carousels, category carousels, user profiles, and site content in a Motoko actor.",
  "feature_evidence.json": "Feature evidence report mapping a category-filtering feature to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for major frontend files including pages, hooks, and admin components.",
  "frontend/index.css": "Tailwind CSS configuration defining light and dark theme variables and applying global styles.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, theme provider, and profile setup modal logic with code-splitting for main pages.",
  "frontend/src/components/admin/CarouselManagement.tsx": "Manages five carousel slide slots with image optimization, upload, URL editing, enabling/disabling, and reordering.",
  "frontend/src/components/admin/CategoryCarouselManagement.tsx": "Handles category‑specific carousel images with optimization, replacement, removal, and bulk save for five slots.",
  "frontend/src/components/admin/InquiryManagement.tsx": "Displays customer inquiries and allows sending responses with status updates.",
  "frontend/src/components/admin/OrderManagement.tsx": "Lists orders, updates status, formats details, and supports printing order information.",
  "frontend/src/components/admin/ProductFormModal.tsx": "Modal for creating or editing products with fields and optimized video/image upload management.",
  "frontend/src/components/admin/ProductManagement.tsx": "Admin UI to list, add, edit, and delete products with image preview and modal form support.",
  "frontend/src/components/admin/SiteContentManagement.tsx": "Form-based admin editor for site-wide content fields such as contact info, policies, and static text.",
  "frontend/src/components/CategoryCarousel.tsx": "Category carousel component fetching category slides, filtering enabled ones, and providing auto-rotation and navigation.",
  "frontend/src/components/CategoryImageCarousel.tsx": "Carousel for category-specific images with validation, auto-rotation, and conditional rendering based on fetched images.",
  "frontend/src/components/CustomerPageStyleScope.tsx": "Wraps children in a customer‑page scoped container for styling purposes.",
  "frontend/src/components/footer/FooterSystem.tsx": "Footer component rendering logo, contact info, policy links, and optional footer text using a split layout.",
  "frontend/src/components/HomeCarousel.tsx": "Carousel that fetches slides, auto-rotates, supports manual navigation, and handles hover-pausing and slide transitions.",
  "frontend/src/components/Layout.tsx": "Main app layout with header, navigation, authentication handling, category menu, and footer integration.",
  "frontend/src/components/OrderDetailModal.tsx": "Modal showing order details with status display and cancellation flow including reason submission.",
  "frontend/src/components/ProductMediaCarousel.tsx": "Product media carousel supporting images and video with slide navigation and smooth transitions.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for creating a user profile, saving it via actor, and updating related queries.",
  "frontend/src/components/RouteLoadingFallback.tsx": "Skeleton-based loading placeholder for lazy-loaded routes.",
  "frontend/src/components/StripeSetupModal.tsx": "Empty file with no implementation.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries on identity change.",
  "frontend/src/hooks/useAdminUiBodyAttribute.ts": "Toggles a data-admin-ui attribute on the body during admin routes for scoped styling.",
  "frontend/src/hooks/useCart.ts": "Zustand store managing cart items, quantity updates, totals, and persisted state.",
  "frontend/src/hooks/useCategoryCarouselQueries.ts": "React Query hooks to fetch and update category-specific carousel images through the backend actor.",
  "frontend/src/hooks/useFooterVariant.ts": "Simple hook returning a constant 'split' footer variant.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for handling Internet Identity login, stored identity restoration, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profile, admin checks, carousel slides, and category-based slide CRUD, using an actor backend.",
  "frontend/src/index.css": "Provides Tailwind base imports and extensive CSS variables for light and dark theme color palettes.",
  "frontend/src/main.tsx": "Initializes the React app root with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Renders the admin dashboard with access control, stats, and management sections for products, orders, inquiries, and site content.",
  "frontend/src/pages/CartPage.tsx": "Displays and manages the user's shopping cart with quantity updates, removal, and pricing, requiring authentication.",
  "frontend/src/pages/categories/AnkletsPage.tsx": "Empty placeholder page with no implementation.",
  "frontend/src/pages/categories/BridalJewelleryPage.tsx": "Empty placeholder page with no implementation.",
  "frontend/src/pages/categories/CategoryNotFoundPage.tsx": "Empty placeholder page with no implementation.",
  "frontend/src/pages/categories/CategoryPageTemplate.tsx": "Reusable category page component that filters products by category slug and displays them with carousels and cart actions.",
  "frontend/src/pages/categories/EarringsPage.tsx": "Empty category page placeholder for earrings.",
  "frontend/src/pages/categories/LabGrownDiamondsJewelleryPage.tsx": "Renders CategoryPageTemplate for the lab-grown diamonds jewellery category.",
  "frontend/src/pages/categories/NecklacePage.tsx": "Empty category page placeholder for necklaces.",
  "frontend/src/pages/categories/RingsPage.tsx": "Empty category page placeholder for rings.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles the checkout flow including address entry, payment step, and order creation for each cart item.",
  "frontend/src/pages/ContactPage.tsx": "Page with authenticated contact form allowing users to submit inquiries using Internet Identity and backend mutation.",
  "frontend/src/pages/CustomerDashboardPage.tsx": "Displays authenticated user's orders and inquiries with status, stats, and order detail modal.",
  "frontend/src/pages/HomePage.tsx": "Homepage showing carousels and product grid with add‑to‑cart and buy‑now logic gated by authentication.",
  "frontend/src/pages/OrdersPage.tsx": "Empty placeholder page with no implementation.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Empty placeholder page with no implementation.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Empty placeholder page with no implementation.",
  "frontend/src/pages/ProductCategoryPage.tsx": "Shows products filtered by category with category header, image carousels, and cart/buy actions.",
  "frontend/src/pages/ProductDetailPage.tsx": "Displays detailed product view with media carousel, pricing, quantity selection, and cart/checkout actions.",
  "frontend/src/utils/mediaOptimization.ts": "Provides image resizing/compression utilities and basic video preview generation for client-side media optimization.",
  "frontend/src/utils/productCategories.ts": "Defines product categories and helper functions for retrieving category metadata and options.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters using query strings and session storage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, and plugin usage.",
  "project_state.json": "Project state metadata including existing features, new requests, and architectural notes."
}