{
  "backend/main.mo": "Defines types for products, orders, media, and site content, and initializes in‑memory maps for products, orders, carousels, inquiries, user profiles, and configuration values.",
  "feature_evidence.json": "Lists feature evidence entries describing logo updates and component changes, with associated files, components, tests, and metadata.",
  "frontend-file-summaries.txt": "Provides prewritten summaries of major frontend files including pages, components, hooks, and admin modules.",
  "frontend/index.css": "Sets Tailwind base, component, and utility layers and declares light/dark theme CSS variables for the app.",
  "frontend/index.html": "Basic HTML shell loading the React app via main.tsx with a root div.",
  "frontend/src/App.tsx": "Configures TanStack Router routes, theme provider, lazy‑loaded pages, and profile setup modal handling based on authentication.",
  "frontend/src/components/admin/CarouselManagement.tsx": "Admin component for managing main carousel slides, including uploading/optimizing images, editing URLs, toggling, saving, and reordering slots.",
  "frontend/src/components/admin/CategoryCarouselManagement.tsx": "Admin component for managing category‑specific carousel slides with the same edit, upload, and reorder logic as the main carousel.",
  "frontend/src/components/admin/InquiryManagement.tsx": "Displays customer inquiries and allows admins to type and send responses, showing status and previous replies.",
  "frontend/src/components/admin/OrderManagement.tsx": "Lists orders, shows product and status details, allows status updates, and supports printing formatted order summaries.",
  "frontend/src/components/admin/ProductFormModal.tsx": "Modal form for creating or editing products, handling fields plus optimized image/video uploads and existing media management.",
  "frontend/src/components/admin/ProductManagement.tsx": "Admin UI for listing, adding, editing, and deleting products with image display and form modal handling.",
  "frontend/src/components/admin/SiteContentManagement.tsx": "Admin form for editing and saving site-wide content fields like contact info, policies, and footer text.",
  "frontend/src/components/CategoryCarousel.tsx": "Carousel component that fetches category slides, filters and auto‑rotates them with hover pause, manual navigation, and slide click redirection.",
  "frontend/src/components/footer/FooterSystem.tsx": "Footer component rendering brand section, contact info, policy links, and optional footer text.",
  "frontend/src/components/HomeCarousel.tsx": "Implements an auto-rotating homepage carousel with hover pause, slide transitions, and click-through support for enabled slides.",
  "frontend/src/components/Layout.tsx": "Defines the main site layout with header navigation, auth handling, scroll-based UI changes, and route outlet rendering.",
  "frontend/src/components/OrderDetailModal.tsx": "Displays detailed order info with status, cancellation logic, and a form for submitting cancellation reasons.",
  "frontend/src/components/ProductMediaCarousel.tsx": "Renders a product media carousel supporting images and video with navigation arrows and slide transitions.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for creating a user profile with validation, backend submission, and query invalidation on success.",
  "frontend/src/components/RouteLoadingFallback.tsx": "Skeleton-based loading placeholder for lazy-loaded routes.",
  "frontend/src/components/StripeSetupModal.tsx": "Empty placeholder file for a Stripe setup modal.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated or anonymous backend actor, refreshing dependent queries on identity change.",
  "frontend/src/hooks/useCart.ts": "Zustand store managing cart items, quantities, persistence, and total calculations.",
  "frontend/src/hooks/useFooterVariant.ts": "Simple hook that always returns the 'split' footer variant.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity auth state, login, logout, and stored identity restoration.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profiles, admin status, carousel slides, and other backend data using an actor interface.",
  "frontend/src/index.css": "Defines Tailwind base layers and a large set of CSS variables for a luxury-themed light and dark mode color palette.",
  "frontend/src/main.tsx": "Bootstraps the React app by mounting it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Renders the admin dashboard with permission checks, stats, and management components for products, orders, inquiries, and site content.",
  "frontend/src/pages/CartPage.tsx": "Displays the authenticated user's cart with item management, pricing, and navigation to checkout.",
  "frontend/src/pages/CheckoutPage.tsx": "Implements a two-step checkout flow collecting shipping details and UPI payment info before creating orders and clearing the cart.",
  "frontend/src/pages/ContactPage.tsx": "Renders a contact form requiring authentication and submits customer inquiries via a mutation.",
  "frontend/src/pages/CustomerDashboardPage.tsx": "Displays authenticated customers' orders and inquiries with status info and order detail modal support.",
  "frontend/src/pages/HomePage.tsx": "Shows product listings, category carousels, and allows authenticated users to add items to cart or navigate to product pages.",
  "frontend/src/pages/OrdersPage.tsx": "Empty page file with no implemented content.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Empty page file with no implemented content.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Empty page file with no implemented content.",
  "frontend/src/pages/ProductDetailPage.tsx": "Displays detailed product info, media carousel, and supports adding to cart or purchasing for authenticated users.",
  "frontend/src/utils/mediaOptimization.ts": "Provides client‑side utilities to resize, compress, and preview images and videos before upload.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session parameters for routing state management.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, custom color palette using OKLCH variables, extended container, radius, and shadow settings, and includes typography, container queries, and animation plugins.",
  "project_state.json": "Stores project state describing the task to crop a brand image to a transparent logo lockup and replace header/footer assets, along with related feature metadata and requirements."
}