{
  "backend/main.mo": "Main Motoko actor defining e-commerce data types (Product, Order, CustomerInquiry, Category, BannerMessage, etc.) and storage maps for products, orders, inquiries, carousel slides, and banner messages with time constants for order cancellation.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: MarqueeBanner component creation, banner message management interface in admin dashboard, and MarqueeBanner integration into Layout component.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend React components and pages including App.tsx with routing, Layout with MarqueeBanner, admin dashboard with banner management, product pages, order management, and various customer-facing pages.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors for background, foreground, primary, secondary, destructive, borders, and sidebar components using oklch color space.",
  "frontend/index.html": "HTML entry point for the Aurelie Fine Jewellery Mobile App with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main React application component with TanStack Router setup, lazy-loaded routes for all pages (home, product, cart, admin, categories, policies), QueryClient configuration, ThemeProvider, ProfileSetupWrapper for first-time user setup, and Toaster for notifications.",
  "frontend/src/components/admin/BannerManagement.tsx": "Admin component for managing banner messages with CRUD operations, ordering, and enable/disable toggles. Supports adding, editing, deleting, and reordering banner messages with drag-and-drop style controls.",
  "frontend/src/components/admin/CarouselManagement.tsx": "Admin component for managing homepage carousel slides with 5 fixed slots, supporting image upload with optimization, URL redirect configuration, enable/disable toggles, and reordering functionality.",
  "frontend/src/components/admin/CategoryCarouselManagement.tsx": "Admin component for managing category-specific carousel images (up to 5) with upload, optimization, reordering, and deletion capabilities. Also manages a redirect URL for the carousel.",
  "frontend/src/components/admin/CategoryImagesManager.tsx": "Manages up to 10 category images with upload, reordering, removal, and primary image selection. Optimizes images to 1200px width at 85% quality before uploading as ExternalBlob.",
  "frontend/src/components/admin/HeaderCategoryNavManagement.tsx": "Admin interface for managing circular category images and redirect URLs for header navigation. Uploads optimized images as ExternalBlob and saves category header configurations per product category slug.",
  "frontend/src/components/admin/InquiryManagement.tsx": "Displays customer inquiries with pending/answered status badges and provides a textarea interface for admins to respond. Uses useGetInquiries and useRespondToInquiry hooks.",
  "frontend/src/components/admin/OrderManagement.tsx": "Lists orders with status badges, allows status updates via dropdown, and provides a print function that generates a styled invoice HTML page. Formats prices in INR and displays product names, shipping addresses, and cancellation reasons.",
  "frontend/src/components/admin/ProductFormModal.tsx": "Modal form for creating/editing products with fields for name, description, price, stock status, category, video (optimized), and up to 5 images (optimized). Handles both new uploads and existing ExternalBlob media.",
  "frontend/src/components/admin/ProductManagement.tsx": "Admin component for managing jewellery products with CRUD operations, displaying product cards with images, prices in INR, and actions to add, edit, or delete products.",
  "frontend/src/components/admin/SiteContentManagement.tsx": "Admin form component for editing site-wide content including contact information, social media links, policies, and static text content with save functionality.",
  "frontend/src/components/CategoryCarousel.tsx": "Category carousel component with 16:9 aspect ratio displaying enabled slides sorted by order, auto-rotation (paused on hover), navigation arrows, dot indicators, click-to-redirect functionality, and loading skeleton states.",
  "frontend/src/components/CategoryImageCarousel.tsx": "Displays an auto-rotating image carousel for product categories with navigation controls, hover pause, and optional redirect URL on click. Fetches carousel images and redirect URLs via custom hooks and handles 16:9 aspect ratio display.",
  "frontend/src/components/checkout/CouponControl.tsx": "Checkout component for applying and removing coupon codes with inline validation, supporting a 10% discount code 'AFJ10'.",
  "frontend/src/components/checkout/UpiQrCode.tsx": "Renders a scannable UPI payment QR code using qrserver.com API and provides a button to copy the UPI link to clipboard.",
  "frontend/src/components/CustomerPageStyleScope.tsx": "Simple wrapper component that adds a data attribute 'data-customer-page=\"true\"' to scope customer-facing page styles.",
  "frontend/src/components/footer/FooterSystem.tsx": "Site footer component displaying logo, contact information, social media links, and policy navigation links using site content from backend.",
  "frontend/src/components/HeaderCategoryNav.tsx": "Renders a horizontal scrollable navigation bar with circular category icons and titles, supporting both internal navigation and external redirects. Hides on admin routes and fetches category header images via custom hooks.",
  "frontend/src/components/HomeCarousel.tsx": "Auto-rotating hero carousel for the homepage with slide transitions, navigation controls, hover pause, and click-to-redirect functionality. Filters and sorts enabled slides by order.",
  "frontend/src/components/HomeCategoryCarouselsSection.tsx": "Section component that displays all product categories with their titles, descriptions, and two carousels each, iterating over PRODUCT_CATEGORIES constant.",
  "frontend/src/components/Layout.tsx": "Main application layout with sticky header containing logo, cart, and user authentication dropdown, plus footer, category navigation, and marquee banner. Handles Internet Identity login/logout and admin access.",
  "frontend/src/components/MarqueeBanner.tsx": "Animated scrolling marquee banner that displays enabled banner messages in a continuous loop with decorative separators and pause-on-hover functionality.",
  "frontend/src/components/OrderDetailModal.tsx": "Modal dialog displaying order details with status badges, item list, pricing breakdown, and cancellation functionality with reason selection. Includes status-specific icons and conditional cancellation form.",
  "frontend/src/components/ProductMediaCarousel.tsx": "A carousel component that displays product media (video and images) with navigation arrows, dot indicators, and lazy loading support. Handles video-first ordering and provides square aspect ratio display with fade transitions.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog for initial user profile setup that collects name, email, phone, and address. Grants admin access if the specific admin email is used and invalidates relevant queries after successful submission.",
  "frontend/src/components/RouteLoadingFallback.tsx": "A loading fallback component that displays skeleton placeholders for lazy-loaded routes, showing header and grid layout skeletons while content loads.",
  "frontend/src/components/StripeSetupModal.tsx": "An empty file with no content.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with Internet Identity authentication, invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useAdminUiBodyAttribute.ts": "Hook that sets data-admin-ui attribute on document.body during admin route lifecycle to enable admin-scoped styling for Radix portals.",
  "frontend/src/hooks/useBannerQueries.ts": "React Query hooks for managing banner messages with CRUD operations, including fetching all/enabled banners and mutations for add/update/delete.",
  "frontend/src/hooks/useCart.ts": "Zustand store with persist middleware for shopping cart state, managing cart items (add, remove, update quantity, clear) and calculating totals.",
  "frontend/src/hooks/useCategoryCarouselQueries.ts": "React Query hooks for fetching and updating category-specific carousel images and redirect URLs using the actor backend.",
  "frontend/src/hooks/useCategoryHeaderNav.ts": "React Query hooks for managing category header navigation data, including fetching all headers, individual headers by slug, and updating them.",
  "frontend/src/hooks/useFooterVariant.ts": "Simple hook that always returns 'split' as the footer variant with no state management.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity delegation, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Comprehensive collection of React Query hooks for all backend operations including user profiles, admin checks, categories, carousels, products, orders, inquiries, and site content management.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom OKLCH color system for Aurelie brand (bottle green, maroon, navy, gold, beige, silver), animated gradient backgrounds, and custom animations for category glows and gold shimmer effects.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Admin page for viewing and managing orders with filtering by date/month/year, status updates, and detailed order information including products and customer details.",
  "frontend/src/pages/admin/CategoryEditPage.tsx": "Admin page for editing category details including name, description, display order, and managing category images with a primary image selector.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page with tabs for managing products, orders, inquiries, site content, carousels, category navigation, and banners, including stats overview cards and access control.",
  "frontend/src/pages/CartPage.tsx": "Displays the shopping cart with item list, quantity controls, and checkout button. Shows login prompt or empty cart message when appropriate, with INR price formatting.",
  "frontend/src/pages/categories/AnkletsPage.tsx": "Category page for Anklets using the CategoryPageTemplate with predefined title and description.",
  "frontend/src/pages/categories/BridalJewelleryPage.tsx": "Category page for Bridal Jewellery using the CategoryPageTemplate with predefined title and description.",
  "frontend/src/pages/categories/CategoryNotFoundPage.tsx": "Empty component file for handling category not found scenarios.",
  "frontend/src/pages/categories/CategoryPageTemplate.tsx": "Reusable template component for category pages that filters and displays products by category with add-to-cart, buy-now, and view-details functionality.",
  "frontend/src/pages/categories/EarringsPage.tsx": "Category page for Earrings using the CategoryPageTemplate with predefined title and description.",
  "frontend/src/pages/categories/LabGrownDiamondsJewelleryPage.tsx": "Category page for Lab Diamonds using the CategoryPageTemplate with predefined title and description.",
  "frontend/src/pages/categories/NecklacePage.tsx": "Category page for Necklaces using the CategoryPageTemplate with predefined title and description.",
  "frontend/src/pages/categories/RingsPage.tsx": "Category page for Rings using the CategoryPageTemplate with predefined title and description.",
  "frontend/src/pages/CheckoutPage.tsx": "Two-step checkout flow (address, then payment) with coupon support, UPI payment integration (QR code and deep links), and order creation. Computes pricing with discounts and validates shipping address.",
  "frontend/src/pages/ContactPage.tsx": "Contact form page that allows authenticated users to submit customer inquiries with name, email, and message fields. Displays login prompt for unauthenticated users.",
  "frontend/src/pages/CustomerDashboardPage.tsx": "Customer dashboard with tabs for orders and inquiries, showing order status badges, stats overview, and order detail modal. Requires authentication and formats prices in INR.",
  "frontend/src/pages/HomePage.tsx": "Main landing page featuring a hero carousel, category carousels section, and product catalog grid with add-to-cart and buy-now actions. Formats prices in INR and handles loading states.",
  "frontend/src/pages/OrdersPage.tsx": "Displays a customer's order history with status badges, order details, and product information; includes a modal for viewing detailed order information and requires authentication.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows a payment failure message with options to return to cart or home page, styled with a red error icon and card layout.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Displays a payment success confirmation with a green checkmark, next steps information, and navigation buttons to view orders or return home.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Renders the privacy policy content fetched from site content API in a simple prose layout with loading state.",
  "frontend/src/pages/ProductCategoryPage.tsx": "Displays products filtered by category slug with grid layout, add-to-cart and buy-now functionality, and category header with title and description.",
  "frontend/src/pages/ProductDetailPage.tsx": "Shows detailed product information including media carousel, price, stock status, quantity selector, and add-to-cart/buy-now buttons with product description and specifications.",
  "frontend/src/pages/ProfileDetailsPage.tsx": "Provides a form for authenticated users to view and edit their profile information (name, email, phone, address, DOB) with validation and save functionality.",
  "frontend/src/pages/ShippingPolicyPage.tsx": "Renders the shipping policy content fetched from site content API in a simple prose layout with loading state.",
  "frontend/src/pages/TermsConditionsPage.tsx": "Displays the Terms & Conditions page by fetching site content from the backend and rendering it with a loading state.",
  "frontend/src/utils/device.ts": "Utility for detecting mobile devices using modern navigator.userAgentData API with fallback to user agent string parsing.",
  "frontend/src/utils/mediaOptimization.ts": "Client-side utilities for optimizing images by resizing and compressing before upload, with basic video preview support.",
  "frontend/src/utils/pricing.ts": "Centralized pricing utilities for computing subtotals, validating coupons, calculating discounts, and formatting INR currency.",
  "frontend/src/utils/productCategories.ts": "Defines product category metadata (slug, title, description) with helper functions for validation and lookup.",
  "frontend/src/utils/upi.ts": "Utility functions for generating UPI payment deep links for Indian payment apps (UPI, Google Pay, PhonePe) with hardcoded Aurelie Fine Jewellery payee details.",
  "frontend/src/utils/urlParams.ts": "URL parameter parsing utilities that work with both regular query strings and hash-based routing, including sessionStorage persistence for parameters like admin tokens.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color palette (bottle-green, blood-maroon, navy, gold, beige, silver) using OKLCH color space and extended theme settings for luxury jewelry branding.",
  "project_state.json": "Project state tracking document showing a luxury jewelry e-commerce site with completed marquee banner component features and pending backend API/storage implementation for banner message management."
}