{
  "kind": "build_request",
  "title": "Add admin-controlled marquee text banner with multiple messages",
  "projectName": "Aurelie Fine Jewellery",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add backend storage and API methods for managing marquee banner messages, including fields for message text, display order, and enabled status. Support CRUD operations (create, read, update, delete) for banner messages.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "admin should be able to add multiple message"
        ]
      },
      "acceptanceCriteria": [
        "Backend stores banner messages with text, order, and enabled status",
        "API methods allow creating, reading, updating, and deleting banner messages",
        "Messages can be reordered by updating their display order value",
        "Only enabled messages are returned to the frontend"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Restrict banner message management API methods to only the admin user with email 'aureliefinejewellery06@gmail.com'. Use the existing admin authorization pattern from the codebase.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "only for the admin control with login ID aureliefinejewellery06@gmail.com"
        ]
      },
      "acceptanceCriteria": [
        "Banner message mutations require admin authorization",
        "Only the specified email address can manage banner messages",
        "Unauthorized attempts return appropriate error responses"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Create a MarqueeBanner component that displays below the header in a static position (not fixed/sticky). The banner should smoothly scroll enabled messages horizontally in a continuous loop with a gold/beige luxury theme matching the existing brand styling.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-5"
        ],
        "quotes": [
          "below the header and remain static in location",
          "Smooth horizontal scrolling with gold/beige luxury styling"
        ]
      },
      "acceptanceCriteria": [
        "Banner appears below the header on all pages",
        "Messages scroll horizontally in a smooth, continuous marquee effect",
        "Banner uses gold/beige colors consistent with the Aurelie brand",
        "Banner position is static (scrolls with page content, not fixed)",
        "Multiple messages display in sequence within the scrolling marquee"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add banner message management interface to the admin dashboard with functionality to add, edit, delete, and reorder multiple banner messages. Include controls for enabling/disabling individual messages.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-5"
        ],
        "quotes": [
          "admin should be able to add multiple message",
          "Add, edit, delete, and reorder multiple messages"
        ]
      },
      "acceptanceCriteria": [
        "Admin dashboard includes a new tab or section for banner management",
        "Interface allows adding new banner messages with text input",
        "Existing messages can be edited or deleted",
        "Messages can be reordered using drag-and-drop or up/down controls",
        "Each message has an enable/disable toggle",
        "Only enabled messages appear in the public marquee banner"
      ]
    },
    {
      "id": "REQ-5",
      "text": "Integrate the MarqueeBanner component into the Layout component so it appears below the header across all pages of the site.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "below the header and remain static in location"
        ]
      },
      "acceptanceCriteria": [
        "Banner renders in Layout component after the header",
        "Banner appears on all customer-facing and admin pages",
        "Banner fetches and displays enabled messages from the backend"
      ]
    }
  ],
  "constraints": [
    "Only the admin user with email 'aureliefinejewellery06@gmail.com' can manage banner messages",
    "Banner must use gold/beige luxury theme matching existing Aurelie brand styling",
    "Banner position must be static (not fixed/sticky) and appear below the header"
  ],
  "nonGoals": [
    "Animated transitions between individual messages (continuous scroll only)",
    "Multiple banner styles or templates",
    "Scheduled banner messages or time-based display",
    "A/B testing or analytics for banner messages",
    "Rich text formatting or HTML in banner messages"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}