{
  "kind": "build_request",
  "title": "Restore 16:9 homepage carousel and set Buy Now text color to dark bottle green (no header/footer changes)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Restore the homepage product carousel so it is visible on the Home page and behaves as it did previously: 16:9 aspect ratio, auto-play enabled, horizontal slide transitions, and left/right navigation arrows, using admin-managed images and redirect URLs.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-last"
        ],
        "quotes": [
          "proceed with both the restored 16:9 product carousel on the home page"
        ]
      },
      "acceptanceCriteria": [
        "On the Home page, a carousel renders above the product catalog when there is at least one enabled carousel slide configured in Admin.",
        "Carousel maintains a 16:9 aspect ratio (e.g., Tailwind `aspect-video`) across responsive breakpoints.",
        "Carousel auto-advances through enabled slides without user interaction.",
        "Carousel provides left/right arrow controls to navigate slides manually.",
        "Clicking a slide navigates to that slide's configured redirect URL from the admin carousel settings.",
        "No changes are made to the site header or footer components/styling."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the 'Buy Now' button text color for product cards shown on the homepage to a dark bottle-green color for both customer and admin users, without changing header/footer.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-last"
        ],
        "quotes": [
          "the dark bottle‑green Buy Now button text colour in homepage. Do not make changes to header and footer"
        ]
      },
      "acceptanceCriteria": [
        "On the Home page product grid, the 'Buy Now' button text is dark bottle green (use the existing bottle-green dark token/class used elsewhere, e.g., `text-bottle-green-dark`, rather than white).",
        "The updated 'Buy Now' text color is visible consistently regardless of whether the viewer is an admin or a customer (same Home page route).",
        "Only the homepage 'Buy Now' button text color is changed; header and footer remain unchanged."
      ]
    }
  ],
  "constraints": [
    "Do not make any changes to header and footer (e.g., do not modify `frontend/src/components/Layout.tsx` or `frontend/src/components/footer/*`).",
    "Do not edit any files under frontend immutable paths (per SYSTEM_CONTEXT), compose existing UI components instead."
  ],
  "nonGoals": [
    "Changing carousel slide administration UX beyond what is required for the homepage carousel to display and link correctly.",
    "Changing button background colors, sizing, or behavior beyond the requested 'Buy Now' text color change on the homepage.",
    "Adding new authentication methods or third-party integrations."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}