{
  "kind": "build_request",
  "title": "Update extracted logo icon and make header fully transparent (remove orange background behind brand name)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-6",
      "text": "Extract the floral logo icon from the newly uploaded image (1770214375269~2.png), remove its background to full transparency, and replace the existing generated icon asset so the app’s header and footer use the updated icon everywhere without changing image references.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Extract the logo from attached image and update same."
        ]
      },
      "acceptanceCriteria": [
        "A new transparent PNG icon is produced from the uploaded image and saved as frontend/public/assets/generated/aurelie-icon-transparent.dim_512x512.png (replacing the prior version).",
        "The icon has a tightly-cropped bounding box around the floral mark (no visible beige background).",
        "Header and footer both display the updated icon automatically (no broken image links)."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Update the global header (frontend/src/components/Layout.tsx) to be fully transparent and remove the orange/gold background/button styling that appears behind the brand name/logo area, while preserving the current sticky + scroll-compress behavior and keeping the brand area clickable for navigation to '/'.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Remove the orange colour background/button in header which is behind brand name.",
          "full transparent"
        ]
      },
      "acceptanceCriteria": [
        "The header background renders as fully transparent at rest and while scrolled (no ivory fill, no backdrop tint).",
        "The brand/logo click target does NOT render any button background/gradient/shimmer behind the icon/wordmark (it appears visually transparent).",
        "The header remains sticky and continues to compress from h-20 to h-16 on scroll exactly as before.",
        "Navigation buttons (Cart/Dashboard/Admin/Login/Logout) retain their current appearance and behavior."
      ]
    }
  ],
  "constraints": [
    "Do not edit files in frontend immutablePaths (including frontend/src/main.tsx and frontend/src/hooks/useActor.ts).",
    "Keep branding usage consistent across all pages by continuing to use the shared Layout header and FooterSystem footer."
  ],
  "nonGoals": [
    "Do not change backend canister logic or data schemas.",
    "Do not redesign the footer layout or modify footer content behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": [
      "Extract the floral emblem as a standalone transparent icon with clean edges and no background (1770214375269~2.png > aurelie-icon-transparent.dim_512x512.png)"
    ]
  }
}