{
  "kind": "build_request",
  "title": "Filter category product listing to show only products from selected category",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the category product listing page to display only products whose stored product.category matches the currently selected categorySlug route param, instead of rendering all products returned by getProducts().",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-User-1",
          "msg-User-2"
        ],
        "quotes": [
          "On the product page, only the relevant product as per category to be displayed not all.",
          "once the user selects the category and then see only product from that category"
        ]
      },
      "acceptanceCriteria": [
        "Navigating to a category route (e.g., /products/<categorySlug> or the app’s equivalent) only renders products where product.category equals the selected category slug.",
        "If there are products in other categories, they are not shown on this category page.",
        "The existing empty-state message is shown only when there are no products for the selected category (not merely when other categories have products).",
        "No changes are made to the HomePage product listing behavior (per latest clarification)."
      ]
    }
  ],
  "constraints": [
    "Frontend files under frontend/src/components/ui must not be edited directly; only compose existing UI components.",
    "Do not modify immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Keep backend as a single Motoko actor in backend/main.mo; do not introduce additional canisters/services."
  ],
  "nonGoals": [
    "Removing products from the home screen UI (user explicitly requested no home page changes for now).",
    "Adding or changing the product schema/category field (category already exists).",
    "Adding new admin UI for categories or changing how categories are authored in the admin product form."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}