{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update floral icon asset + transparent global header branding area",
  "requirements": [
    {
      "id": "REQ-6",
      "summary": "Replace the generated floral icon asset with a newly extracted, tightly-cropped transparent PNG while keeping all existing image references unchanged so header/footer update automatically.",
      "acceptanceCriteria": [
        "A new transparent PNG icon is produced from the uploaded image and saved as frontend/public/assets/generated/aurelie-icon-transparent.dim_512x512.png (replacing the prior version).",
        "The icon has a tightly-cropped bounding box around the floral mark (no visible beige background).",
        "Header and footer both display the updated icon automatically (no broken image links)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/aurelie-icon-transparent.dim_512x512.png",
          "operation": "modify",
          "description": "Replace this existing generated asset with a new transparent PNG extracted from the uploaded source image (1770214375269~2.png), ensuring tight crop around the floral mark and fully transparent background; keep the same filename/path to avoid changing any references."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Make the global header fully transparent and remove any button/background styling behind the brand (icon/wordmark) while preserving sticky + scroll-compress behavior and homepage navigation on brand click.",
      "acceptanceCriteria": [
        "The header background renders as fully transparent at rest and while scrolled (no ivory fill, no backdrop tint).",
        "The brand/logo click target does NOT render any button background/gradient/shimmer behind the icon/wordmark (it appears visually transparent).",
        "The header remains sticky and continues to compress from h-20 to h-16 on scroll exactly as before.",
        "Navigation buttons (Cart/Dashboard/Admin/Login/Logout) retain their current appearance and behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Update the header container styling to remove opaque/background and backdrop tint so it renders fully transparent while keeping the existing sticky positioning and scroll-based height compression; also update the brand click target styling (currently a button) to neutralize any global button background/shimmer so the icon/wordmark area is visually transparent while remaining clickable and navigating to '/'."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add/adjust a dedicated utility class for the header brand click target that overrides the global button shimmer/background/text-shadow rules (and any descendant styling) so the brand area can be a visually transparent click target without affecting the existing navigation button styling."
        }
      ]
    }
  ]
}