{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restore 16:9 homepage carousel behavior and update Home page Buy Now text color",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure the Home page product carousel is visible (when enabled slides exist), stays 16:9, auto-plays with horizontal transitions, supports left/right arrows, and redirects using admin-configured URLs—without header/footer changes.",
      "acceptanceCriteria": [
        "On the Home page, a carousel renders above the product catalog when there is at least one enabled carousel slide configured in Admin.",
        "Carousel maintains a 16:9 aspect ratio (e.g., Tailwind `aspect-video`) across responsive breakpoints.",
        "Carousel auto-advances through enabled slides without user interaction.",
        "Carousel provides left/right arrow controls to navigate slides manually.",
        "Clicking a slide navigates to that slide's configured redirect URL from the admin carousel settings.",
        "No changes are made to the site header or footer components/styling."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/HomeCarousel.tsx",
          "operation": "modify",
          "description": "Confirm the homepage carousel uses enabled admin-managed slides (sorted by order), keeps a 16:9 container (aspect-video), auto-plays, uses horizontal slide transitions, and provides left/right arrow navigation controls; ensure slide clicks navigate to the admin-configured redirect URL. Use the blob-storage ExternalBlob.getDirectURL() rendering pattern for slide images. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Ensure the HomeCarousel is wired above the product catalog on the Home page and that it renders only when enabled slides exist (via HomeCarousel returning null), without touching header/footer-related files. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Change only the Home page product-card 'Buy Now' button text color to dark bottle green for all viewers (admin/customer), without header/footer changes.",
      "acceptanceCriteria": [
        "On the Home page product grid, the 'Buy Now' button text is dark bottle green (use the existing bottle-green dark token/class used elsewhere, e.g., `text-bottle-green-dark`, rather than white).",
        "The updated 'Buy Now' text color is visible consistently regardless of whether the viewer is an admin or a customer (same Home page route).",
        "Only the homepage 'Buy Now' button text color is changed; header and footer remain unchanged."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Update the Home page product grid 'Buy Now' button styling so its text uses the existing dark bottle-green token/class (e.g., text-bottle-green-dark) and is not forced to white by any homepage CTA overrides (e.g., remove customer-cta-btn from Buy Now only). Keep all other button behavior and header/footer untouched. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}