{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add admin-controlled marquee text banner with multiple messages",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Create a MarqueeBanner component that displays below the header with smooth horizontal scrolling of enabled messages in a gold/beige luxury theme",
      "acceptanceCriteria": [
        "Banner appears below the header on all pages",
        "Messages scroll horizontally in a smooth, continuous marquee effect",
        "Banner uses gold/beige colors consistent with the Aurelie brand",
        "Banner position is static (scrolls with page content, not fixed)",
        "Multiple messages display in sequence within the scrolling marquee"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MarqueeBanner.tsx",
          "operation": "create",
          "description": "Create a new MarqueeBanner component that fetches enabled banner messages from the backend using getEnabledBannerMessages() backend capability. Display messages in a horizontally scrolling marquee with smooth continuous loop animation. Style with gold/beige luxury colors matching the Aurelie brand theme defined in frontend/src/index.css and frontend/tailwind.config.js. Use CSS animations or a library like react-fast-marquee for smooth scrolling. The banner should be static (not fixed/sticky) and respond gracefully to empty message lists."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add banner message management interface to the admin dashboard with CRUD operations and reordering controls",
      "acceptanceCriteria": [
        "Admin dashboard includes a new tab or section for banner management",
        "Interface allows adding new banner messages with text input",
        "Existing messages can be edited or deleted",
        "Messages can be reordered using drag-and-drop or up/down controls",
        "Each message has an enable/disable toggle",
        "Only enabled messages appear in the public marquee banner"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/BannerManagement.tsx",
          "operation": "create",
          "description": "Create an admin component for managing marquee banner messages. Display all banner messages in a sortable list with fields for message text, display order, and enabled status. Include forms for adding new messages using addBannerMessage() backend capability. Support editing existing messages with updateBannerMessage() and deleting with deleteBannerMessage(). Implement drag-and-drop or up/down arrows for reordering messages by updating their order values. Add enable/disable toggles for each message. Show real-time preview of the marquee banner. Restrict access to admin users only using the authorization component's access control pattern."
        },
        {
          "path": "frontend/src/hooks/useBannerQueries.ts",
          "operation": "create",
          "description": "Create React Query hooks for banner message operations. Include useGetAllBannerMessages() for fetching all messages (admin view), useGetEnabledBannerMessages() for fetching only enabled messages (public view), useAddBannerMessage() mutation, useUpdateBannerMessage() mutation, useDeleteBannerMessage() mutation, and useReorderBannerMessages() mutation. Each mutation should invalidate the banner messages query cache. Handle loading states and error messages appropriately."
        },
        {
          "path": "frontend/src/pages/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Add a new tab labeled 'Banner Messages' or 'Marquee Banner' to the existing admin dashboard tabs. Wire the new tab to render the BannerManagement component. Place the tab in a logical position within the existing tab structure (likely near site content or carousel management). Ensure the tab is only visible to authenticated admin users."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Integrate the MarqueeBanner component into the Layout component so it appears below the header across all pages",
      "acceptanceCriteria": [
        "Banner renders in Layout component after the header",
        "Banner appears on all customer-facing and admin pages",
        "Banner fetches and displays enabled messages from the backend"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Import and render the MarqueeBanner component immediately after the header element in the Layout component. Ensure the banner appears in the static flow of the page (not fixed/sticky). The banner should fetch enabled messages using the useGetEnabledBannerMessages() hook from frontend/src/hooks/useBannerQueries.ts. Handle loading and empty states gracefully - hide the banner if no enabled messages exist. The banner will automatically appear on all pages since Layout wraps all routes."
        }
      ]
    }
  ]
}